[
    {
        "common": "Abelia",
        "botanical": "Abelia grandiflora",
        "height": [
            "3",
            "6"
        ],
        "characteristics": "Abelia is a very durable and adaptable shrub with dense, glossy dark green foliage. It produces hundreds of 1\" funnel shaped flowers from early summer until the first frost",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "African Daisies",
        "botanical": "Osteospermum barberae",
        "height": [
            "12",
            "18"
        ],
        "characteristics": "Osteospermums should be grown in full sun, but they will tolerate some partial shade. They produce a steady supply of unique 2\" spoon flowers from early spring until the first frost",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "African Daisy",
        "botanical": "Arctotis x hybrida",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "African Daisies typically have bold, beautiful foliage and large, 3\"-4\", intensely colored flowers with bright centers. The foliage is gray to silvery green and coated with soft, downy silver hairs. The flowers close at night.",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alfalfa",
        "botanical": "Medicago sativa",
        "height": [
            "3",
            null
        ],
        "characteristics": "Alfalfa is a nitrogen fixing, legumous member of the pea family which is used as feed for farm animals or as a cover crop. It produces clusters of small flowers",
        "zones": [
            "4",
            "7"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Algerian Ivy",
        "botanical": "Hedera canariensis",
        "height": [],
        "characteristics": "Algerian Ivy's glossy 4-8\" foliage and the vines ability to crawl, creep and climb just about anywhere makes this a great ground cover or privacy screen",
        "zones": [
            "4",
            "7"
        ],
        "benefits": "\n"
    },
    {
        "common": "Flowering Onion",
        "botanical": "Allium species",
        "height": [
            "1",
            "6"
        ],
        "characteristics": "Flowering Onions are bulb type plants with green, grass-like foliage. They produce hollow, leafless stems that are topped with 1\"-5\" flower clusters that can contain as many as 100 tiny, star shaped flowers.",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Alpine Aster",
        "botanical": "Aster alpinus",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "The Alpine Aster plant forms a nice compact mound and produces an abundance of 1 ½\" white flowers in May and June",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alpine Columbine",
        "botanical": "Aquilegia flabellata",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "Violet with white flowers are borne on stiff stalks above the lacy bluish green foliage of the durable, self seeding Alpine Columbine",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alpine Pinks",
        "botanical": "Dianthus alpinus",
        "height": [
            "4",
            "8"
        ],
        "characteristics": "This true alpine species of Pinks forms cushions of neat, dark green foliage. In mid-summer they produce dozens of extra large but otherwise typical looking, sweet smelling Dianthus flowers. Deer resistant",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alpine Poppy",
        "botanical": "Papaver alpinum",
        "height": [
            "6",
            "10"
        ],
        "characteristics": "This short lived, miniature version of the Iceland Poppy readily re seeds itself. It produces saucer shaped 1\" white, yellow or peach flowers in mid summer",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alpine Speedwell",
        "botanical": "Veronica allionii",
        "height": [
            "8",
            "18"
        ],
        "characteristics": "Groundcover, Rock Gardens, Containers, Lawn Substitute\nThis evergreen Veronica forms a tight mat of soft green foliage. An abundance of small spikes of light blue flowers arise in early summer. Mow or shear flower spikes down after bloom to keep neat.",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Alpine Speedwell",
        "botanical": "Veronica alpina",
        "height": [
            "8",
            "18"
        ],
        "characteristics": "Rock Gardens, Containers\nEasy to grow creeping evergreen with 1\"-2\", glossy green or fuzzy gray foliage. Blooms mainly in spring, flowering on and off until fall, producing airy spikes of white, rose, pink, pale or deep blue flowers.",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Amaryllis",
        "botanical": "Hippeastrum",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "Amaryllis is the easiest of all bulbs to force into bloom. The 4-6\" flowers appear in all shades and combinations red, white, pink, salmon and orange on top of a 1-2 foot stem",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "American Dune Grass",
        "botanical": "Leymus racemosus 'Glaucus'",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "American Dune Grass is a valuable plant for the prevention of the wind eroding your soil due to its rhizomatous spreading habit",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Angel's Trumpets",
        "botanical": "Brugmansia",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "From early summer until fall, mature Angel's Trumpet's produce waves of large, very fragrant, downward hanging, trumpet shaped, 6\"-10\" long flowers. In frost free regions, they may bloom all year long.",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Asparagus Fern",
        "botanical": "Protasparagus setaceus",
        "height": [
            "10",
            null
        ],
        "characteristics": "The Asparagus Fern is a very popular plant for florists who commonly use the lacy fronds in arrangements. These decorative vines will grow up to 10 feet with support, or they can be kept to a more compact size by regularly removing the tips from new growth.",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Annual Aster",
        "botanical": "Callistephus chinensis",
        "height": [
            "8",
            "24"
        ],
        "characteristics": "This annual plant is a native to Asia. The 2-4\" flowers range in color from blue, white, red, yellow, or pink on 1'-3' stems. Do not plant annual varieties of Asters in the same are for more than two consecutive years to prevent Aster wilt.",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Aster",
        "botanical": "Aster novae-angliae",
        "height": [
            "12",
            "24"
        ],
        "characteristics": "Asters grow into a dense mound of light green foliage. In May and through June, the plant will become covered with soft, 1 1/2\" white, purple, pink or red flowers",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Aubrieta",
        "botanical": "Aubrieta deltoidea",
        "height": [
            "2",
            "6"
        ],
        "characteristics": "Common Aubrieta is a vigorous growing, mat forming ground cover and rock garden plant. It is tolerant of a wide range of conditions, and rewards you with a long lasting cover of delicate flowers in early Spring.",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Australian Saltbush",
        "botanical": "Atriplex semibaccata",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "The Creeping Saltbush is a low growing shrub from Australia with light green curly leaves. It will survive in areas where there is high levels of salt in the soil. Flowers in the summer are insignificant",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Autumn Fern",
        "botanical": "Dryopteris erythrosora",
        "height": [
            "15",
            "24"
        ],
        "characteristics": "The fronds of the Autumn Fern begin to emerge in early spring as a copper to reddish color and mature to dark green by mid summer. In the fall months, Autumn Ferns once again change colors. They should be planted in evenly moist, compost rich soil and grown where they will receive partial to full shade.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": ""
    },
    {
        "common": "Avens",
        "botanical": "Geum chiloense",
        "height": [
            "16",
            "18"
        ],
        "characteristics": "Geums form 16\"-18\" tall, spreading mounds of evergreen, coarsely textured, dark green leaves. From May until July they produce leafy, 24\" branching stems that hold intensely colored, solitary, 1\"-1¾\" flowers or small clusters of smaller, brightly colored flowers.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Azalea",
        "botanical": "Rhododendron",
        "height": [
            "1",
            "8"
        ],
        "characteristics": "Azaleas must be grown in an acid soil, with a pH of 5.0 to 6.5. The buds for next years blooms will be formed this year, so it important that the faded blooms are removed",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Baby Sun Rose",
        "botanical": "Aptenia cordifolia",
        "height": [
            "10",
            null
        ],
        "characteristics": "The Baby Sun Rose is a trailing, succulent perennial with glossy green foliage. It produces bright 1\" flowers in the spring and summer. Excellent for hanging baskets",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Basket of Gold",
        "botanical": "Aurinia saxatilis",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "Dense clusters of gold flowers in Spring and early Summer.",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Bat Face Plant",
        "botanical": "Cuphea llavea",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Bat Face Flowers are low maintenance, shrubby perennials with glossy green, lance shaped leaves. They grow 18\"-24\" tall with a three foot spread. Bat Face Cupheas produce masses of 1\" purple tubular flowers with two bright red, upward facing petals.",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Beach Daisy",
        "botanical": "Asteriscus maritimus",
        "height": [
            "12",
            null
        ],
        "characteristics": "Beach Daisies are low growing evergreen plants that grow 1 ft. tall with a 3-4 ft. spread. They have leathery, slightly fuzzy, silvery green foliage, and for 6-8 months of the year will cover themselves with 1\"-1½\", bright yellow Daisy flowers.",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bearded Iris",
        "botanical": "Iris germanica",
        "height": [
            "6",
            "48"
        ],
        "characteristics": "Bearded Iris are a rhizomous type of Iris should be planted fertile, well drained soil where they will receive 5-8 hours of sun each day. They are available in almost every color imaginable.",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Beard Tongue",
        "botanical": "Penstemon Barbatus",
        "height": [
            "12",
            "24"
        ],
        "characteristics": "Tubular flowers in red, pink, purple, or white will be sure to attract butterflies and hummingbirds to your garden.",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bears Breeches",
        "botanical": "Acanthus species",
        "height": [
            "3",
            "4"
        ],
        "characteristics": "Bear's Breeches are huge, mound forming perennials with dramatic, deeply cut, bright green leaves that can reach one foot wide and two feet long. From late spring until mid summer, they produce impressive, 2-3 foot tall spikes of hooded, white or light pink flowers.",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Beauty Berry",
        "botanical": "Callicarpa bodinieri",
        "height": [
            "6",
            "8"
        ],
        "characteristics": "Beautyberry grows to a height of 6-8 feet. The foliage is a beautiful bronze color as it emerges in spring. Small lavender flowers in mid-summer produce clusters of intensely purple berries in the Fall",
        "zones": [
            "6",
            "8"
        ],
        "benefits": " \n\n"
    },
    {
        "common": "Bachelor's Button",
        "botanical": "Centaurea cyanus",
        "height": [
            "18",
            "36"
        ],
        "characteristics": "Bachelor's Button is the annual version of the Mountain Cornflower. It is an easy to grow plant that quickly forms a nice clump. It begins producing it's bright flowers in late spring and will often continue blooming well into fall. Excellent for dried flowers and potpourri.",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Bee Balm",
        "botanical": "Monarda didyma",
        "height": [
            "2",
            "4"
        ],
        "characteristics": "Like other members of the Mint Family, Bee Balm can become invasive. The plant should be divided every 3 years to keep it tidy. Stimulate a second flowering in the same year by cutting the bright crimson flowers right after they bloom",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Begonia Rex",
        "botanical": "Begonia rex-cultorum",
        "height": [
            "4",
            "12"
        ],
        "characteristics": "The Rex or Painted-Leaf Begonias are rhizomatous, clump forming, tender perennials that are normally grown as house plants. Their leaves vary considerably in texture, size, shape, patterns and colors. The inconspicuous, small, pink or white flowers may appear at any time of the year",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Spotted Lungwort",
        "botanical": "Pulmonaria officinalis",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "Spotted Lungwort is a clumping, evergreen perennial that is known for its pretty, marbled foliage and brilliantly colored spikes of nodding flowers that appear in early spring and last for several weeks",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Big Bluestem",
        "botanical": "Andropogon gerardii",
        "height": [
            "4",
            "7"
        ],
        "characteristics": "Big Bluestem forms large clumps of stiff silvery green to blue foliage, turning to a copper color in fall",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Bird of Paradise",
        "botanical": "Strelitzia reginae",
        "height": [
            "4",
            "5"
        ],
        "characteristics": "Bird of Paradise plants are evergreen perennials with large paddle shaped leaves, that are grown for their spectacular flowers. They can be grown from seed, which take up to 18 months to germinate, or they can be propagated by division. Can be grown as a house plant",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bitter Root",
        "botanical": "Lewisia cotyledon",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Bitter Root plants produce clusters of 1\" flowers on 10\" stems in shades of white to pink or gold, occasionally with red and white stripes from spring to early summer. Easily hybridized Rock Garden plant. Lewisias can be grown as house plants.",
        "zones": [
            "5",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Black Eyed Susan",
        "botanical": "Rudbeckia hirta",
        "height": [
            "24",
            "36"
        ],
        "characteristics": "The Black Eyed Susan is most commonly an annual wildflower, but some varieties are perennial or biennial. These native prairie flowers can be found growing wild in almost every state. These bright, daisy like flowers are excellent to use in cut flower arrangements. Deadheading spent flowers will prolong the blooming period considerably.",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Black Eyed Susan Vine",
        "botanical": "Thunbergia alata",
        "height": [
            "6",
            "20"
        ],
        "characteristics": "The Black-Eyed Susan Vine is an evergreen, twining vine, most often grown as a long blooming annual. Black-Eyed Susan Vines have dark green, arrowhead-shaped, 3\" leaves. They produce a profusion of brightly colored, 1½\" bell-shaped flowers from early summer, well into the fall.",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Black Mondo Grass",
        "botanical": "Ophiopogon planiscapus",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "Black Mondo Grass grows as neat, slowly spreading, 4\" tufts of ¼\" wide, sweetly fragrant, straplike leaves. New foliage emerges dark green in spring then changes to dark purplish-black by summer. Loose spikes of small, light pink or white, bell shaped flowers appear in mid summer.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Blanket flower",
        "botanical": "Gaillardia grandiflora",
        "height": [
            "1",
            "3"
        ],
        "characteristics": "Blanket flowers are clumping upright perennials with light green foliage. Their Daisy-like flowers appear in mid summer and are up to four inches in diameter. Blanket Flowers are easily grown from seeds",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bleeding Heart",
        "botanical": "Dicentra spectabilis",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Bleeding Heart is a mound forming plant with finely cut, fern-like foliage on graceful 2-3 foot arching stems topped with pretty, heart shaped, 1\" flowers in late spring or early summer. Excellent plants for any shade garden or woodland setting",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bluebeard",
        "botanical": "Caryopteris clandonensis",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Bluebeard plants are low growing shrubs that are covered with fragrant, blue flowers in late summer and early fall. The silvery green, 1\"-2\" leaves have a light aroma of Eucalyptus when rubbed. Bluebeard flowers are a favorite food for butterflies and bees.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bluebell of Scotland",
        "botanical": "Campanula rotundifolia",
        "height": [
            "1",
            "3"
        ],
        "characteristics": "The Bluebell Bellflower is a clump forming perennial that, from June through September, produces multiple stems, each with a single nodding bell shaped flower. Campanula can be grown from seed or propagated by division. (Campanula comes from the Latin word campana, which means 'bell')",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Blue Bugleweed",
        "botanical": "Ajuga genevensis",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Typical Ajuga with 8\" blue flowers in the Spring. Deer Resistant ground cover",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Blue Carpet",
        "botanical": "Campanula carpatica",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "Blue or white bell shaped flowers through early Summer.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Chalksticks",
        "botanical": "Senecio serpens",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "Blue Chalksticks is a succulent sub-shrub from South Africa consisting of 4-6\", ½-¾\" thick, powder blue segments. In extremely hot areas, it should be protected from direct sun.",
        "zones": [
            "10",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Clumping Wheatgrass",
        "botanical": "Elymus magellanicus",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "Blue Clumping Wheatgrass is a clump forming plant with bright metallic blue foliage, producing taller stems of small blue flowers in early summer",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Corydalis",
        "botanical": "Corydalis flexuosa",
        "height": [
            "12",
            "18"
        ],
        "characteristics": "Blue Corydalis is a slow growing, evergreen perennial that will eventually form a dense 18\" clump of elegant, 12\" tall, lace-like green foliage. Eighteen inch spikes of dangling, tubular, sky blue flowers will adorn the plant from late spring until fall in regions with cool summers",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Blue Eyed Grass",
        "botanical": "Sisyrinchium brachypus",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Clumps of Iris like leaves; brightblue, star-shaped flowers June to September",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Fescue",
        "botanical": "Festuca glauca",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "Blue Fescue is a durable plant that grows in clumping mounds of fine blue foliage. They tend to die out in the center after a couple years and will need to be divided",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Flax",
        "botanical": "Linum narbonense",
        "height": [
            "18",
            null
        ],
        "characteristics": "Clumps of soft green foliage, long lasting funnel shaped violet flowers in the Summer",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Hill Sage",
        "botanical": "Salvia superba",
        "height": [
            "12",
            "15"
        ],
        "characteristics": "Narrow erect plant with irregular leaves, spikes of intensely bluish purple flowers all Summer if spent flowers are removed. Drought tolerant, Prefers slightly alkaline soil",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "  \n\n"
    },
    {
        "common": "Blue Lungwort",
        "botanical": "Pulmonaria angustifolia",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "Blue Lungwort is a clumping, deciduous perennial with an 'I'll grow anywhere' attitude. They have light green, lance shaped foliage and produce short clusters of brightly colored flowers for several weeks in early spring",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Oat Grass",
        "botanical": "Helictotrichon sempervirens",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Blue Oat Grass is an easily maintained and durable, clump forming plant with coarse, silver blue foliage",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Sedge",
        "botanical": "Carex flacca",
        "height": [
            "6",
            "18"
        ],
        "characteristics": "Blue Sedge produces slow spreading clumps of fine blue foliage. Great as a ground cover plantor for growing in a container.",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Blue Star Creeper",
        "botanical": "Laurentia fluviatilis",
        "height": [
            "2",
            "4"
        ],
        "characteristics": "Blue Star Creeper is a fast growing, mat forming, light green walk-on-it ground cover. It covers itself with small star shaped flowers from May through June. Excellent filler between paving stones and in rock gardens",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Bottlebrush",
        "botanical": "Callistemon lanceolatus",
        "height": [
            "10",
            "20"
        ],
        "characteristics": "Bottlebrush is a small, slow growing evergreen tree with light green, elliptical shaped 6\" leaves. New growth has a nice copper hue. Brightly colored, 1½\" bottle brush flowers appear conspicuously in the spring",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bougainville",
        "botanical": "Bougainvillea",
        "height": [
            "2",
            "20"
        ],
        "characteristics": "Bougainvillias produce some of the showiest display of colors of all vines. Most cultivars have an upright growth habit, but there are many shrubby varieties and creeping types as well.",
        "zones": [
            "9",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Brass Buttons",
        "botanical": "Leptinella squalida",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "The interesting feathery, fern like foliage of the New Zealand Brass Buttons may give the impression that it is a delicate plant, but in reality, it is a tough enough ground cover that it can take light foot traffic and is even used as a lawn substitute in many areas.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Brazilian Plume Flower",
        "botanical": "Justicia carnea",
        "height": [
            "3",
            "5"
        ],
        "characteristics": "The Brazilian Plume Flower is a shade loving, tropical evergreen perennial shrub with large deep green leaves.\nIt produces a never ending show of large spikes of brightly colored, tubular flowers from spring to fall.",
        "zones": [
            "9",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Bronze Sedge",
        "botanical": "Carex comans 'Bronze Form'",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "Bronze Sedge forms dense tufts of fine bladed bronze colored foliage. It is a good ornamental grass for growing in containers",
        "zones": [
            "7",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Bugleweed",
        "botanical": "Ajuga reptens",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Ajuga grows well in full shade to full sun and tolerates a wide range of soil conditions as long as soil is well drained.",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Bunchberry",
        "botanical": "Cornus canadensis",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Bunchberry Dogwoods are probably the ultimate ground cover plants for growing in moist, woodland areas or in your shade garden. These short, bright green plants only reach six inches tall. They produce bright red berries that are eaten by many species of wild birds.",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Burning Bush",
        "botanical": "Dictamnus albus",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "The Burning Bush, or Gas Plant, earned it's name because of the phenomina created by the fact that the leaves, flowers and seed pods give off a strong lemon scented vapor which, on a calm summer night can be ignited with a match.",
        "zones": [
            "3",
            "7"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Butterfly bush",
        "botanical": "Buddleia davidii",
        "height": [
            "6",
            "15"
        ],
        "characteristics": "The Butterfly Bush is a fast growing, profuse blooming, deciduous shrub that will grow in almost any type of soil. Prune hard in early spring and remove spent flowers promptly.",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Butterfly Gaura",
        "botanical": "Gaura lindheimeri",
        "height": [
            "2",
            "4"
        ],
        "characteristics": "Butterfly Gaura are shrubby, perennial wildflowers that are closely related to the Evening Primrose. From late spring until first frost, they produce 8\"-24\" spikes of 1\" flowers that are white when they open at dawn and fade to rose-pink as the sun sets.",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Butterfly Lily",
        "botanical": "Hedychium coronarium",
        "height": [
            "2",
            "4"
        ],
        "characteristics": "Butterfly lilies are only suited for growing in warmer climates. Fragrant pink or white flowers that resemble butterflies appear on 5-8 ft. stalks in late summer and into the fall",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Butterfly Pea",
        "botanical": "Clitoria ternata",
        "height": [],
        "characteristics": "Butterfly Pea is a fast growing climber is a fairly common tender perennial species that produces two inch flowers in mid to late Summer. A quick cover for lattice, a trellis, arbors and chain-link fences",
        "zones": [
            "10",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Butterfly Weed",
        "botanical": "Asclepias tuberosa",
        "height": [
            "2",
            null
        ],
        "characteristics": "Butterfly Weed is a perennial wildflower, native to the United States. This upright growing plant has long fuzzy foliage and produces fragrant, bright orange flowers atop 3 ft. stems in July and August",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Caladium",
        "botanical": "Colocasia esculenta",
        "height": [
            "12",
            "18"
        ],
        "characteristics": "The Caladium is a frost tender, perennial tuber which is grown for its colorful foliage rather than flowers. The leaves are usually a combination of different shades of red, pink, green, white.",
        "zones": [
            "10",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Calla Lily",
        "botanical": "Zantedeschia aethiopica",
        "height": [
            "1",
            "4"
        ],
        "characteristics": "Callas are rhizomous, clump forming plants known for their large, lush green foliage and beautiful, stately white, pink, yellow or red flowers. These Arums are worth growing for their long lasting cut flowers alone.",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Camellia",
        "botanical": "Camellia",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Camellias are long lived evergreen shrubs or small trees that can grow anywhere from 6-20 feet tall with up to a 10 foot spread, depending on the species and cultivar. They have glossy, dark green, 2\"-4\" foliage that is attractive even when the plant is out of bloom. The flower colors range from pure white to deep, dark red and there are even some bi-colored varieties.",
        "zones": [
            "7",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Campion",
        "botanical": "Lychnis species",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "The botanical name, Lychnis, is from the Greek word for lamp, referring to the flame colored flowers of some species and the fact that the felt-like leaves were once used for lamp wicks.",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Candytuft",
        "botanical": "Iberis species",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "The Iberis genus of plants includes about forty different species of annuals, perennials and sub-shrubs, with flower colors in shades of white, red, pink or lavender. They are great plants for borders or in your Rock Garden.",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Canna Lily",
        "botanical": "Canna generalis",
        "height": [
            "3",
            "6"
        ],
        "characteristics": "Canna is a rhizomous growing plant that is known for their large, thick leaves that unfurl like those of the Banana plant. Intensely colored, three petaled flowers emerge from the top of 3-8 ft. spikes in mid summer. Dig and store rhizomes in colder areas. They can be grown in containers",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cape Fuchsia",
        "botanical": "Phygelius capensis",
        "height": [
            "3",
            "5"
        ],
        "characteristics": "Phygelius are completely unrelated to Fuchsias. They are actually relatives of Foxgloves and Penstemons",
        "zones": [
            "7",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cape Marigold",
        "botanical": "Arctotheca calendula",
        "height": [
            "3",
            "6"
        ],
        "characteristics": "The Cape Marigold is a rosette forming evergreen that is commonly grown as an annual plant. It produces loose, aster-like flowers in the summer. Cape Marigold is considered invasive or noxious in some areas",
        "zones": [
            "10",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Cardinal Flowers",
        "botanical": "Lobelia cardinalis",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "The intensely bright red flower spikes of the Cardinal Flower serve as a beacon to the hummingbirds and butterflies who dine on the flower's nectar. The plant itself also acts as a host for some species of butterfly larvae",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Carolina Jasmine",
        "botanical": "Gelsemium sempervirens",
        "height": [],
        "characteristics": "Semi-evergreen, yellow trumpet blooms in spring, quickly climbs to great heights where it forms masses of foliage and bloom",
        "zones": [
            "7",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Castor Bean",
        "botanical": "Ricinus communis",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "Castor Beans are fast growing, tender perennial shrubs that are capable of growing up to 12 feet in a single season. Castor Bean plants have reddish colored stalks with very large palmate shaped, deep green to dark purple leaves that can grow up to 2 feet wide. Seeds of the Castor Bean plant are extremely poisonous!",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cat's Foot",
        "botanical": "Antennaria dioica",
        "height": [
            "2",
            "6"
        ],
        "characteristics": "Cat's Foot is a mat forming North American native wildflower with durable silvery foliage. It produces light to bright pink flowers in late spring and early summer. Excellent mimi ground cover for hot and dry spots in the garden",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Catmint",
        "botanical": "Nepeta faassenii",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "Catmint is a compact, upright branching perennial that grows 1-2 feet tall with a spread of 18\". From early summer into fall, Catmint plants produce long, loose spikes of pretty, ½\" violet-blue flowers. Cats love it, and it repels Aphids!",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Catnip",
        "botanical": "Nepeta cataria",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Catnip is a very easy to grow and care for plant that is somewhat less ornamental than Catmint. Catnip plants grow to 3 feet tall, with a spread of 1½-2 feet. In the summer and early fall, they produce 3\"-4\" spikes of tiny white flowers spotted with pale purple.",
        "zones": [
            "3",
            "7"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Chameleon Plant",
        "botanical": "Houttuynia cordata variegata",
        "height": [
            "6",
            "12"
        ],
        "characteristics": "The red, cream and green colored foliage of Chameleon Plants will be the brightest when they are planted in full sun, but this ground cover will grow more vigorously in partial shade. It should be grown in boggy conditions or can be planted directly into ponds or along stream banks. Insignificant flowers appear in mid summer",
        "zones": [
            "5",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Checkerbloom",
        "botanical": "Sidalcea malviflora",
        "height": [
            "3",
            "4"
        ],
        "characteristics": "Sprawling growth of round leaves, loose heads of pink to white flowers throughout the Summer",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Chilean Mitre Flowers",
        "botanical": "Mitraria coccinea",
        "height": [
            "6",
            null
        ],
        "characteristics": "The Chilean Mitre Flower is a gorgeous creeping and climbing, plant with glossy, dark green leaves arranged in pairs along woody stems. They produce an abundance of intensely colored, scarlet-orange, tubular 1½\" flowers with a soft, velvety texture.",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Chinese Lantern Plant",
        "botanical": "Physalis alkekengi",
        "height": [
            "24",
            null
        ],
        "characteristics": "The Chinese Lantern Plant produces small white flowers in early summer which are followed by vivid orange-red, papery seed pods that resemble Chinese Lanterns. The fruiting stems can be cut and used in flower arrangements or dried. May tend to become invasive.",
        "zones": [
            "5",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Chocolate Cosmos",
        "botanical": "Cosmos atrosanguineus",
        "height": [
            "12",
            "15"
        ],
        "characteristics": "The dark maroon flowers of Chocolate Cosmos appear on wirey 18 inch stems from June until frost and produce a pleasant chocolate scent. With excellent drainage and heavy winter mulching Chocolate Cosmos will often survive in zone 6.",
        "zones": [
            "7",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Christmas Kalanchoe",
        "botanical": "Kalanchoe blossfeldiana",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "Christmas Kalanchoes are easy to grow, winter blooming plants with waxy, green, scalloped edged leaves, and clusters of tiny, brightly colored flowers that continue for 6 weeks or longer. Most Kalanchoes that are commonly available today are dwarf hybrids that only reach 8\"-12\" tall.",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Christmas Rose",
        "botanical": "Helleborus niger",
        "height": [
            "12",
            "15"
        ],
        "characteristics": "The Christmas Rose is one of the easier and most rewarding garden plants to grow, Their ability to bloom in the darkest months of the year when everything else is frozen solid make them a valuable asset to any garden. A Christmas Rose will produce flowers from late fall up until early spring.",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Chrysanthemum",
        "botanical": "Chrysanthemum",
        "height": [
            "12",
            "24"
        ],
        "characteristics": "Chrysanthemums are just about the easiest of all of the perennials to grow. They should be planted in early spring after all danger of freezing, however they can be planted almost any time. Chrysanthemums are induced to bloom when the nights become longer than the days...",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Cigar Plant",
        "botanical": "Cuphea cyanea",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "The Cigar Plant or Black Eyed Cuphea as it is also known, form two foot tall mounds of lance-shaped, bright green leaves with brittle stems. They produce foot long sprays of tubular, orangish-red to pink, 1\"-1½\" flowers with two tiny black petals.",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cigarette Plant",
        "botanical": "Cuphea ignea",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "The Cigarette Flower plant is sometimes called a Firecracker Plant. They have small, lance shaped, glossy green leaves that form tight mounds and tubular, petal-less, bright orange-red, ¾\"-1¼\" flowers.",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cineraria",
        "botanical": "Pericallis cruenta",
        "height": [
            "12",
            "24"
        ],
        "characteristics": "Cineraria plants form 12\"-24\" tall, mounded clumps of large, lush, bright green leaves which create a nice accent for the vividly colored, 3\"-5\" flowers that stand above it in the spring and summer.",
        "zones": [
            "9",
            "11"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Cinquefoil",
        "botanical": "Potentilla fruticosa",
        "height": [
            "2",
            "3"
        ],
        "characteristics": "Potentillas prefer well-drained, reasonably rich soil, but will tolerate clay, rocky, or even slightly alkaline soils as well. Loads of pink or yellow 'buttercup' flowers in June.",
        "zones": [
            "2",
            "7"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Clematis 'Snowdrift'",
        "botanical": "Clematis armandii",
        "height": [],
        "characteristics": "Abundant, fragrant 2-3 inch flowers in March through April. Attractive, evergreen covering for fences and arbors. Clematis like their heads in the sun and their roots in the shade.",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Clematis 'Anna Karolina'",
        "botanical": "Clematis Anna Karolina",
        "height": [],
        "characteristics": "Clematis 'Anna Karolina' produces loads of 5-6\" white flowers in late Spring and again in late Summer on short six to nine foot vines. Prune back to 3-4 ft. in late winter. Clematis like their heads in the sun and their roots in the shade",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Climbing Fig",
        "botanical": "Ficus pumila",
        "height": [],
        "characteristics": "Climbing Figs are frost tender, fast growing evergreen vines. The foliage lays flat so it is useful for covering walls and flat surfaces. Easy propagation by layering or softwood cuttings",
        "zones": [
            "8",
            "11"
        ],
        "benefits": ""
    },
    {
        "common": "Cockscomb",
        "botanical": "Celosia Argentea",
        "height": [
            "12",
            "16"
        ],
        "characteristics": "Plumosa cultivar flowers resemble plume like feathers, while Cristata flowers looks like a rooster's comb with crested heads and ridges. Low maintenance, good for dried flowers",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Clustered Bellflower",
        "botanical": "Campanula glomerata",
        "height": [
            "12",
            "24"
        ],
        "characteristics": "Clustered Bellflowers are upright growing perennials with light green, fuzzy lance shaped foliage. They produce a cluster of one inch, vase shaped flowers atop 2 ft. stems all summer if the spent blossoms are removed promptly",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Coastal Wood Fern",
        "botanical": "Dryopteris arguta",
        "height": [
            "18",
            "24"
        ],
        "characteristics": "Coastal Wood Ferns can be grown in most average garden soils as long as it is well draining. They grow best in partial or full shade, but can be grown in full sun if they are kept moist.",
        "zones": [
            "4",
            "8"
        ],
        "benefits": ""
    },
    {
        "common": "Columbine",
        "botanical": "Aquilegia",
        "height": [
            "12",
            "18"
        ],
        "characteristics": "The Columbine is an easy plant to grow because it adapts itself to a wide variety of conditions. They are a favorite flower for hummingbirds, and are excellent additions to rock gardens or in a native woodland planting",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Coral Bells",
        "botanical": "Heuchera sanguinea",
        "height": [
            "12",
            "18"
        ],
        "characteristics": "Coral Bells are compact growing, 18\" mounding, evergreen plants that offer a growing variety of outstanding foliage colors in shades of purple, rose, lime green, gold as well as many striking variegations.",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Coral Vine",
        "botanical": "Antigonon leptopus",
        "height": [],
        "characteristics": "Coral Vine is a vigorous growing, evergreen climber with dark green arrow shaped leaves. It produces clusters of vivid pink flowers in late Summer. This vine can grow up to 30 ft. in a season",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Corkscrew Rush",
        "botanical": "Juncus effusus 'Spiralis'",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "The Corkscrew Rush is a slow growing rush known for its wild, corkscrewing foliage. It is easily grown in wet soils, including up to four inches of standing water",
        "zones": [
            "4",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Cosmos",
        "botanical": "Cosmos bipinnatus",
        "height": [
            "3",
            "5"
        ],
        "characteristics": "Cosmos are extremely heat and drought tolerant. They prefer full sun and do well in poor, infertile soil. Cosmos plants come in a rainbow of summer blooming flower colors",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Cotoneaster",
        "botanical": "Cotoneaster",
        "height": [
            "3",
            "15"
        ],
        "characteristics": "Cotoneaster is an extremely diverse genus of plants which includes ground covers, dwarf sized bushes and large sprawling shrubs. The flowers are generally small and appear from spring to early summer followed by bright red or orange berries for the birds to eat in winter.",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Cranesbill",
        "botanical": "Erodium reichardii",
        "height": [
            "3",
            "6"
        ],
        "characteristics": "Erodiums are low growing plants that form compact, dense 12\" evergreen mounds of tufted, dark green foliage with scalloped edges. From April until October they produce ½\" saucer shaped, rose-pink flowers or white flowers with red veins.",
        "zones": [
            "7",
            "10"
        ],
        "benefits": "\n"
    },
    {
        "common": "Creeping Baby's Breath",
        "botanical": "Gypsophila repens",
        "height": [
            "4",
            "6"
        ],
        "characteristics": "Creeping Baby's Breath forms a low growing mat of tiny grayish green foliage and produces masses of small star shaped flowers in early summer. This plant is easily grown from seed or propagated by division. Trim back after blooming",
        "zones": [
            "3",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Creeping Buttercup",
        "botanical": "Ranunculus repans",
        "height": [
            "9",
            "12"
        ],
        "characteristics": "In many places, especially my gardens, Creeping Buttercups are considered to be a noxious and invasive weed! However, they may have their place in a poorly drained, shady area of your garden. They have green, deeply cut, snowflake foliage and bright yellow flowers in spring.",
        "zones": [
            "8",
            "11"
        ],
        "benefits": "\n"
    },
    {
        "common": "Creeping Lily Turf",
        "botanical": "Liriope spicata",
        "height": [
            "8",
            "10"
        ],
        "characteristics": "Creeping Lily Turf is a grass like ground cover that grows as spreading clumps of fine, dark green leaves that turn to bronze-green in the winter. Lily Turf produces spikes of tiny flowers in late summer, followed by dark blue berries in late fall.",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Creeping Mazus",
        "botanical": "Mazus reptans",
        "height": [
            "1",
            "3"
        ],
        "characteristics": "These Cup Flowers are fast spreading ground cover plants that quickly form a dense mass of jagged light green foliage. Covers itself with pretty, orchid-like flowers in the late spring. Good for planting between pavers or as a carpet-like border planting",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Creeping Speedwell",
        "botanical": "Veronica prostrata",
        "height": [
            "6",
            "24"
        ],
        "characteristics": "Groundcover, Rock Gardens, Borders,\nWoody, mat forming plant with coarsely serrated edges. Produces loose spikes of small blue, star shaped flowers in early summer. Deadhead spent flowers for a re bloom in early fall. Drought tolerant once established.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Creeping Speedwell",
        "botanical": "Veronica repens",
        "height": [
            "1",
            "18"
        ],
        "characteristics": "Groundcover, Rock Gardens\nForms a fast growing, spreading evergreen mat of small, glossy green leaves. Produces small, pale blue or white flowers all spring. Ideal for growing between flagstones.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Creeping Zinnia",
        "botanical": "Sanvitalia procumbens",
        "height": [
            "6",
            "10"
        ],
        "characteristics": "Creeping Zinnia is a bright little yellow flowering annual plant. They should be planted in rich, well draining soil, in full sun.",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Crocus",
        "botanical": "Crocus",
        "height": [
            "3",
            "6"
        ],
        "characteristics": "Crocus need four weeks of winter's chilling (below 50°) in order to bloom in the spring. Crocus bulbs can be forced into bloom at any time of the year",
        "zones": [],
        "benefits": "\n\n"
    },
    {
        "common": "Croton",
        "botanical": "Codiaeum variegatum",
        "height": [
            "3",
            "8"
        ],
        "characteristics": "Crotons are tender perennial plants that will grow to three feet tall or more. They are most often grown as house plants or in a greenhouse environment. Their thick, glossy foliage is brightly colored in combinations and shades of red, yellow, pink, orange, burgundy, bronze or green.",
        "zones": [
            "11",
            "12"
        ],
        "benefits": "\n"
    },
    {
        "common": "Crown Imperial",
        "botanical": "Fritillaria imperialis",
        "height": [
            "3",
            "4"
        ],
        "characteristics": "Crown Imperials are impressive, spring flowering bulbs that have been cultivated since the 16th century. Once the stalk begins to emerge in mid-spring, it grows very quickly to a height of 3-4 feet and adorns itself with a crown of nodding, bell shaped flowers topped with a tuft of bright, glossy green leaves.",
        "zones": [
            "5",
            "9"
        ],
        "benefits": "\n\n"
    },
    {
        "common": "Crown Vetch",
        "botanical": "Coronilla varia",
        "height": [
            "24",
            null
        ],
        "characteristics": "Sprawling leafy stems with an abundance of pink clover-like flowers throughout the Summer",
        "zones": [
            "6",
            "10"
        ],
        "benefits": " \n"
    },
    {
        "common": "Cup and Saucer Bellflower",
        "botanical": "Campanula calacanthema",
        "height": [
            "8",
            "12"
        ],
        "characteristics": "There are about three hundred different species of Campanula. This annual variety prefers full sun and rich, well drained soil and should be kept well watered, especially when in bloom.",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Cup Flower",
        "botanical": "Nierembergia",
        "height": [
            "6",
            "9"
        ],
        "characteristics": "Cup Flowers are long lasting annual plants that produces hundreds of 1\", upturned star shaped flowers from late spring until mid fall. It is great for hanging baskets and planters or as a quick ground cover",
        "zones": [],
        "benefits": "\n"
    },
    {
        "common": "Cupid's Dart",
        "botanical": "Catananche caerulea",
        "height": [
            "18",
            "24"
        ],
        "characteristics": "Cupid's Darts are short lived perennials that form 12\" clumps of 18\"-24\", narrow gray leaves that radiate out from the root crown. The single, 1\"-2\" flower heads appear atop leafless upright stems from early summer until fall.\n",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "\n"
    },
    {
        "common": "Curly Top Sedge",
        "botanical": "Carex buchananii",
        "height": [
            "1",
            "2"
        ],
        "characteristics": "Curly Top Sedge is a very versatile grass, due to its ability to tolerate most growing conditions. Stiff bronze red foliage",
        "zones": [
            "6",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "Cushion Pink",
        "botanical": "Silene acaulis",
        "height": [
            "2",
            "4"
        ],
        "characteristics": "Soft, hairy leaves spread slowly to form a low mat. Tubular pink flowers appear in late summer or early Fall",
        "zones": [
            "2",
            "9"
        ],
        "benefits": "\n"
    },
    {
        "common": "",
        "botanical": "Cyclamen",
        "height": [],
        "characteristics": "2-5\"",
        "zones": [],
        "benefits": "6-7"
    },
    {
        "common": "\n",
        "botanical": "Cypress Vine",
        "height": [],
        "characteristics": "",
        "zones": [
            "1",
            null
        ],
        "benefits": ""
    },
    {
        "common": "\n\n",
        "botanical": "Dahlias",
        "height": [],
        "characteristics": "1-6 ft.",
        "zones": [
            "2",
            null
        ],
        "benefits": "7-11"
    },
    {
        "common": "\n\n",
        "botanical": "Daffodil",
        "height": [],
        "characteristics": "6-15\"",
        "zones": [
            "50",
            null
        ],
        "benefits": "Hardy"
    },
    {
        "common": " \n",
        "botanical": "Daisy",
        "height": [],
        "characteristics": "18-36\"",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "5-10"
    },
    {
        "common": "\n\n",
        "botanical": "Dandelion",
        "height": [],
        "characteristics": "1-2\"",
        "zones": [],
        "benefits": "5-11"
    },
    {
        "common": "\n\n",
        "botanical": "Daylily",
        "height": [],
        "characteristics": "10-24\"",
        "zones": [],
        "benefits": "3-9"
    },
    {
        "common": "\n",
        "botanical": "Deer Fern",
        "height": [],
        "characteristics": "18-24\"",
        "zones": [],
        "benefits": "5-8"
    },
    {
        "common": "\n",
        "botanical": "Delphinium",
        "height": [],
        "characteristics": "2-6 ft.",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "3-9"
    },
    {
        "common": "\n\n",
        "botanical": "Dogbane",
        "height": [],
        "characteristics": "3 ft.",
        "zones": [
            "8",
            null
        ],
        "benefits": "4-10"
    },
    {
        "common": "\n\n",
        "botanical": "Dragon Lily",
        "height": [],
        "characteristics": "18-24\"",
        "zones": [],
        "benefits": "5-8"
    },
    {
        "common": "\n",
        "botanical": "Dusty Miller",
        "height": [],
        "characteristics": "12-24\"",
        "zones": [],
        "benefits": "8-11"
    },
    {
        "common": "\n\n",
        "botanical": "Dutch Iris",
        "height": [],
        "characteristics": "6-10\"",
        "zones": [
            "5",
            "8"
        ],
        "benefits": "3-10"
    },
    {
        "common": "\n\n",
        "botanical": "Dutchman's Pipe",
        "height": [],
        "characteristics": "6-9\"",
        "zones": [],
        "benefits": "5-8"
    },
    {
        "common": " \n",
        "botanical": "Dutchman's Pipe",
        "height": [],
        "characteristics": "",
        "zones": [],
        "benefits": "8-10"
    },
    {
        "common": "\n\n",
        "botanical": "Dwarf Baby's Breath",
        "height": [],
        "characteristics": "3\"",
        "zones": [],
        "benefits": "5-10"
    },
    {
        "common": "\n",
        "botanical": "Coyote Brush",
        "height": [],
        "characteristics": "2-3 ft.",
        "zones": [],
        "benefits": "7-10"
    },
    {
        "common": "\n\n",
        "botanical": "Dwarf Fountain Grass",
        "height": [],
        "characteristics": "12-24\"",
        "zones": [
            "30",
            null
        ],
        "benefits": "5-9"
    },
    {
        "common": "\n",
        "botanical": "Dwarf Yarrow",
        "height": [],
        "characteristics": "8\"",
        "zones": [],
        "benefits": "5-10"
    },
    {
        "common": "\n\n",
        "botanical": "Easter Cactus",
        "height": [],
        "characteristics": "6-12\"",
        "zones": [],
        "benefits": "9-12"
    },
    {
        "common": "  ",
        "botanical": "Easter Lilies",
        "height": [],
        "characteristics": "12-30\"",
        "zones": [
            "60",
            "65"
        ],
        "benefits": "Hardy"
    },
    {
        "common": "\n\n",
        "botanical": "Echeveria imbricata",
        "height": [],
        "characteristics": "6-12\"",
        "zones": [],
        "benefits": "8-11"
    },
    {
        "common": "\n",
        "botanical": "Elderberry",
        "height": [],
        "characteristics": "10-20 ft.",
        "zones": [],
        "benefits": "4-10"
    },
    {
        "common": "\n\n",
        "botanical": "English Daisy",
        "height": [],
        "characteristics": "3\"-6\"",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "4-10\n"
    },
    {
        "common": "\n\n",
        "botanical": "English Ivy",
        "height": [],
        "characteristics": "",
        "zones": [],
        "benefits": "4-7"
    },
    {
        "common": "",
        "botanical": "English Lavender",
        "height": [],
        "characteristics": "12-24",
        "zones": [],
        "benefits": "6-9"
    },
    {
        "common": "\n\n",
        "botanical": "English Marigold",
        "height": [],
        "characteristics": "6\"-24\"",
        "zones": [
            "3",
            "5"
        ],
        "benefits": ""
    },
    {
        "common": "\n\n",
        "botanical": "Eucalyptus",
        "height": [],
        "characteristics": "1-180 ft.",
        "zones": [
            "180",
            null
        ],
        "benefits": "8-11"
    },
    {
        "common": "\n\n",
        "botanical": "Evening Primrose",
        "height": [],
        "characteristics": "2-4 ft.",
        "zones": [],
        "benefits": "4"
    },
    {
        "common": "\n\n",
        "botanical": "Evening Primrose (hardy)",
        "height": [],
        "characteristics": "6-18\"",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "5-8"
    },
    {
        "common": "\n\n",
        "botanical": "Evergreen Smilax",
        "height": [],
        "characteristics": "",
        "zones": [],
        "benefits": "6-8"
    },
    {
        "common": "\n\n",
        "botanical": "Exbury Azalea",
        "height": [],
        "characteristics": "4-12 ft.",
        "zones": [
            "7",
            "18"
        ],
        "benefits": "5-9"
    },
    {
        "common": "\n",
        "botanical": "Fairy Fan Flower",
        "height": [],
        "characteristics": "8-12\"",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "9-11"
    },
    {
        "common": "\n\n",
        "botanical": "Fairy Lily",
        "height": [],
        "characteristics": "5-8\"",
        "zones": [],
        "benefits": "8-11"
    },
    {
        "common": "\n",
        "botanical": "",
        "height": [],
        "characteristics": "Epimedium",
        "zones": [
            "6",
            "20"
        ],
        "benefits": "Fairy Wings (Bishops Cap) will survive in one of the most difficult situations in the garden; the dry shade beneath a tree."
    },
    {
        "common": "4-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Schefflera elegantissima",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "False Aralias are small, tropical evergreen trees that are native to the islands of the South Pacific. In their native environment, Schefflera elegantissima can grow up to 26 feet tall, but when grown in pots or planters they seldom reach more than 4-6 feet tall."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Smilacina racemosa",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "False Solomon's Seal should be grown in well drained but moist, slightly acidic soil"
    },
    {
        "common": "5-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Astilbe chinensis",
        "zones": [
            "6",
            "24"
        ],
        "benefits": "The fern like foliage and the showy plume flowers of False Spirea make them a favorite summer flowering perennial."
    },
    {
        "common": "6",
        "botanical": "\n",
        "height": [],
        "characteristics": "Fatshedera lizei",
        "zones": [],
        "benefits": "Fatshedera is a hardy evergreen, non climbing vine that is the result of the cross between Fatsia japonica and Hedera helix. Fatshedera tends to grow upwards a few feet before falling and creeping across the ground"
    },
    {
        "common": "8-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Calamagrostis acutiflora",
        "zones": [
            "5",
            "7"
        ],
        "benefits": "Feather Reed Grass is fairly drought resistant and tolerates a wide range of garden soils. It is deer resistant plant"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Crossandra infundibuliformis",
        "zones": [
            "2",
            null
        ],
        "benefits": "Firecracker Flowers are upright growing, tender perennials that are usually grown as house plants. They have bright green, glossy foliage and produce spikes of brightly colored flowers. Provide extra humidity by setting planter on top of a tray filled with moist stones"
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Miscanthus purpurascens",
        "zones": [
            "4",
            "5"
        ],
        "benefits": "Flame Grass is an easy to grow, clumping grass. The coloration of its red foliage intensifies as the summer progresses, turning into a flaming reddish orange in the fall."
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Pyrostegia venusta",
        "zones": [],
        "benefits": "Flame Vines are fast growing, branching, evergreen vines that produce massive clusters of bright orange tubular flowers in late winter and early spring. Excellent fence cover"
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Anthurium species",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "Flamingo Flower plants are durable and fairly easy to grow house plants that will thrive for many years under ideal conditions and can even survive for a year or two in the most adverse situations. They need bright light but never full sun, and high humidity."
    },
    {
        "common": "11-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Erigeron glaucus",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Clump forming, small spoon shaped leaves; Daisy-like pink flowers"
    },
    {
        "common": "3-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dianthus caryophyllus",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Florist's Carnations are actually tender perennials that are best grown from seed as an annual and then disposed of. They prefer alkaline soil and dislike heat. They produce richly fragrant flowers in the summer"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ageratum",
        "zones": [
            "6",
            "24"
        ],
        "benefits": "Ageratum is known for its furry mounds of long lasting floss-like blue flowers, occasionally you can find them in white and pink. Deadhead regularly for continued bloom"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Prunus blireiana",
        "zones": [
            "15",
            "20"
        ],
        "benefits": "Flowering Plums seldom produce fruit due to a lack of pollinators when they bloom, but the dark purple plums are edible. The fragrant, one inch, pink flowers appear in early spring followed by purple foliage which turns green by mid-summer"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Chaenomeles speciosa",
        "zones": [
            "3",
            "10"
        ],
        "benefits": "Flowering Quince is a twiggy, rounded upright deciduous shrub. The 1\" foliage opens to a beautiful reddish bronze color before turning dark green by mid summer. Showy cup shaped flowers cover each stem in the spring before turning to an edible fruit by summers end"
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ribes sanguineum",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "This 6-10 foot tall deciduous shrub is hardy in USDA Planting Zones 5-8 In early spring it produces pendulous clusters of red or pink flowers that attract and feed hummingbirds, bees and butterflies. The small bluish-black berries are eaten by a wide variety of wild birds."
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Nicotiana alata",
        "zones": [
            "30",
            "36"
        ],
        "benefits": "Flowering tobacco is a tall, easy to grow annual that is useful for garden backgrounds or for eye catching mass plantings. It produces an abundance of 2½\" star shaped flowers all summer until first frost. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tiarella cordifolia",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Foamflowers are easy to grow, perennial wildflowers that form 6\"-10\" tall clumps of heart shaped leaves. They quickly spread to form nice two foot patches of this shade loving groundcover. Tiarella produce wispy plumes of creamy white or pale pink, ¼\" star shaped flowers."
    },
    {
        "common": "3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Myosotis palustris",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "Dense mat of small green leaves covered with tiny blue flowers."
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pennisetum alopecuroides",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Fountain grass slowly grows in a compact clump that will stay as wide as it grows tall. Arching spikes of 12\" purplish-cream flower bristles throughout the summer"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Mirabilis jalapa",
        "zones": [
            "24",
            null
        ],
        "benefits": "Four o' clocks are fragrant, colorful and very easy to grow. The plants got their name, Four o' clock, because the flowers do not open till around 4 o'clock in the afternoon, except on cloudy days. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Digitalis purpurea",
        "zones": [
            "3",
            "6"
        ],
        "benefits": "Foxglove is a biennial flower which is native to Europe but now grows wild in most temperate climates of the world. Foxgloves prefer moist, well draining, fertile soil but can survive drought and almost any growing conditions."
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "P. densiflorus 'Meyeri'",
        "zones": [
            "2",
            null
        ],
        "benefits": "Foxtail Ferns produces arching two foot 'fronds' of dense light green needles, creating the illusion of a pack of upright fox tails. Foxtail Ferns are very similar to Sprenger's Asparagus except the growth habit is much denser."
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Eremurus robustus",
        "zones": [
            "24",
            "36"
        ],
        "benefits": "Straplike green leaves with 24\" spikes of pink flowers atop 8 ft. stems in late Spring"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Freesia x hybrida",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Freesias are tender, brightly flowered, easy to care for bulbs that can be grown in the garden, in planters, or as a house plant in a sunny, cool room. Their fragrant, 2\" flowers open over a long blooming period, in sequence along arching, wirey stems."
    },
    {
        "common": "9-10",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Lysimachia ciliata",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Fringed Loosestrife is an outstanding, fast growing North American wildflower that grows in upright mounds of deep purplish green foliage. Each stem becomes studded with small golden flowers in mid summer. Excellent contrast near lighter foliage plants"
    },
    {
        "common": "5",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Fuchsia",
        "zones": [
            "1",
            "4"
        ],
        "benefits": "Fuchsia care is often determined by where you live and your climate. Fuchsias can be seed grown or struck from softwood cuttings. Not all varieties are hardy"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Fuchsia arborescens",
        "zones": [
            "8",
            "15"
        ],
        "benefits": "Tree Fuchsias are small trees that produce large clusters of tube bright, shaped flowers at almost any time of the year, followed by small purple fruits"
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Gardenia jasminoides",
        "zones": [
            "6",
            null
        ],
        "benefits": "Gardenias should be planted in well conditioned soil containing peat moss and compost. Keep the soil moist, cool and weed free. Proper temperatures are necessary for a gardenia to bloom. May be grown as a house plant"
    },
    {
        "common": "9-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Dianthus",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Most Garden Pinks are tender perennial or biennial clump forming plants that prefer alkaline soil and dislike heat. They produce richly fragrant flowers in the spring or summer, sometimes extending right up until the first frost."
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Liatris spicata",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "The Gayfeather, Liatris spicata is an interesting perennial plant which produces a 1-3 foot tall spike of bright purplish-pink or white flowers in late June to early fall. Liatris are easily grown from seeds"
    },
    {
        "common": "3-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Veronica gentianoides",
        "zones": [
            "18",
            "18"
        ],
        "benefits": "Rock Gardens, Borders, Containers\nEasy to grow, compact mat forming evergreen with deep green, glossy foliage. Produces loose, 10\" spikes of powder blue to white flowers in late spring to mid-summer. Tolerates periods of wet soil."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pelargonium hortorum",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "Geraniums are among the most popular flowering plants. They belong to a large family of sun loving annuals and tender perennials so should be planted outdoors where they will receive at least 6 to 8 hours of sunlight daily, but only after all danger of frost is past and the soil has warmed."
    },
    {
        "common": "\n9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Stipa gigantea",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Giant Feather Grass forms a large, loose clump of grayish foliage. Seven foot arching stems of tan flower spikes persist through the summer months. Needs well drained soil"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Arundo donax 'Versicolor'",
        "zones": [
            "5",
            "12"
        ],
        "benefits": "Giant Reed Grass produces large green stalks with white stripes. It is good for background plantings"
    },
    {
        "common": "7-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Miscanthus 'Giganteus'",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "Giant Silver Grass grows into a massive upright clump that performs equally well as a background planting or as a specimen in the center of your yard"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Gladiolus",
        "zones": [
            "12",
            "36"
        ],
        "benefits": "The Gladiola is an easy care, erect growing, corm type plant that produces a tall spike of dramatic, brightly colored flowers in mid to late summer. Dig and store rhizomes in colder areas."
    },
    {
        "common": "8-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Chionodoxa luciliae",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "Narrow green leaves; stalk of 10-12 loose, star shaped, bright blue flowers with white centers in early Spring"
    },
    {
        "common": "4-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "8-12\"",
        "zones": [],
        "benefits": "Gloxinias come in a wide range of colors, with variations in both foliage and flower forms. They are tuberous plants which are usually grown as houseplants, but may also be grown in containers in a shaded part of the garden."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Galega officinalis",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Light green, lance shaped foliage with spikes of pink pea-like flowers in mid-Summer"
    },
    {
        "common": "5-10",
        "botanical": " \n",
        "height": [],
        "characteristics": "Forsythia",
        "zones": [
            "1",
            "10"
        ],
        "benefits": "One of the earliest signs that spring has arrived, is when the Forsythia bursts into a profusion of yellow blossoms spreading from the ground to the tip of each graceful, cascading branch. Forsythias will grow in almost any soil or growing condition"
    },
    {
        "common": "4-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Laburnum watereri",
        "zones": [
            "12",
            "15"
        ],
        "benefits": "Golden Chain Trees are fairly ordinary looking plants when they are not in bloom... but... when the 12\"-24\" pendulous clusters of bright yellow, pea-like flowers open, the Golden Chain Tree transforms into a real traffic stopper."
    },
    {
        "common": "5-7",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lysimachia punctata",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Golden Loosestrife is an excellent plant for bog gardens or next to ponds and streams. This 3-4 foot tall perennial has light green, 3\" leaves with serrated edges. In the summer, they produce abundant spikes of star shaped, golden yellow flowers, tinged in red at the base."
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Solidago virgaurea",
        "zones": [
            "12",
            "36"
        ],
        "benefits": "Goldenrod is an aggressively spreading, upright clumping, deciduous perennial plant with light green foliage. It produces sprays of bright yellow flowers from mid summer until mid fall"
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pachystachys lutea",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "Golden Shrimp Plants are shrubby plants that are each tipped with brightly colored, 4\" golden yellow bracts that are adorned with small, creamy white flowers. In zones 10-12 they are popular as landscape plants. In cooler zones they are more often grown as house plants."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Allamanda cathartica",
        "zones": [],
        "benefits": "The Golden Trumpet Vine is a prolific blooming, frost tender perennial. It can be potted up and grown as a house plant. All parts of Allamanda cathartica are extremely toxic"
    },
    {
        "common": "9-11",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Alopecurus pratensis 'Aureovariegatus'",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Soft yellowish green with a golden stripe. This ornamental grass is NOT related to Foxtail barley grass!"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Hakonechloa macra",
        "zones": [
            "2",
            null
        ],
        "benefits": "Forest Grass is a slowing plant with gracefully arching, green and gold bamboo like foliage"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lonicera heckrottii",
        "zones": [],
        "benefits": "Honeysuckle vines are easy to grow, vigorous, heat-tolerant, and nearly indestructible. The flashy and fragrant flowers will attract hummingbirds and butterflies all summer long."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Carex dolichostachya",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Gold Fountain Grass produces mounds of slender green grass-like leaves with borders tinged in gold. Prefers rich organic soils"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Achillea filipendulina",
        "zones": [
            "4",
            null
        ],
        "benefits": "Gold Plate Yarrow is a long blooming perennial with fern like grayish green foliage and 4-6\" bright yellow flower clusters"
    },
    {
        "common": "3-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Muscari",
        "zones": [
            "5",
            "8"
        ],
        "benefits": "Grape Hyacinths are small, long lived bulbs that look their best when planted in masses. They need twelve weeks of winter's chilling (below 50°) in order to bloom in the spring. Grape Hyacinth can be forced into bloom at any time of the year"
    },
    {
        "common": "3-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Herniaria glabra",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Tiny, bright green, trailing foliage, turning reddish in the Fall; flowers are insignificant"
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Convolvulus mauritanicus",
        "zones": [
            "1",
            null
        ],
        "benefits": "Ground Morning Glories are drought resistant, evergreen perennials that are useful as ground covers, rock gardens and border plantings. They have fuzzy grayish green leaves and pretty, funnel shaped lavender blue flowers in the Summer"
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Glechoma hederacea",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Ground Ivy is an aggressively growing, evergreen ground cover. It will survive almost anywhere that there is sufficient moisture. The five inch spikes of tiny orchid-like flowers appear continuously from March through July"
    },
    {
        "common": "Hardy",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dianthus caryophyllus",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Hardy Carnations are low maintenance, long blooming perennials. (Unfortunately they are only hardy to zone 8) They prefer alkaline soil and dislike heat. They produce their sweetly fragrant flowers all spring"
    },
    {
        "common": "8-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Incarvillea delavayi",
        "zones": [
            "2",
            "15"
        ],
        "benefits": "Hardy Gloxinia plants produce compact 12\" clumps of deep green, deeply divided, fern-like leaves. From mid-spring until mid-summer, leafless, 12\"-24\" tall stems rise above the foliage to showcase clusters of 2\"-3\", yellow throated, magenta to pink or white, trumpet shaped blooms."
    },
    {
        "common": "6-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Delosperma cooperi",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "The Hardy Purple Ice Plant is a vigorous growing succulent ground cover. Dozens of bright magenta, Daisy-like flowers in mid to late Summer. Needs good drainage"
    },
    {
        "common": "5-7",
        "botanical": "\n",
        "height": [],
        "characteristics": "Delosperma nubigenum",
        "zones": [
            "2",
            null
        ],
        "benefits": "Hardy Yellow Ice Plant is an evergreen succulent plant. Due to its vigorous carpeting growth habit it is outstanding ground cover and rock garden plant. The plant covers itself with hundreds of yellow daisies in late spring."
    },
    {
        "common": "5-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Corylus avellana 'Contorta'",
        "zones": [
            "8",
            "10"
        ],
        "benefits": "Discover the true inner beauty of Harry Lauder's Walking Stick... The fantastically twisted, gnarled, contorted, spiraling branches will quickly capture your imagination. Well suited for growing as an outdoor container plant."
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Asplenium scolopendrium",
        "zones": [
            "24",
            "30"
        ],
        "benefits": "Unlike most other ferns, tropical looking Hart's Tongue Fern has strap-like undivided fronds. These glossy green ferns are native to most areas of the world with alkaline soil. Keep the soil evenly moist. Hart's Tongue Ferns are well suited for growing as a container plant."
    },
    {
        "common": "6-8",
        "botanical": "",
        "height": [],
        "characteristics": "Bergenia cordifolia",
        "zones": [
            "10",
            "15"
        ],
        "benefits": "Bergenia's clusters of purple-pink flowers are produced atop twelve inch burgundy stems in the early spring. Glossy 8 inch heart shaped leaves"
    },
    {
        "common": "3-9",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Nandina domestica",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Nandina can be grown in partial shade, but the foliage colors will be much more intense if it is grown in full sun. Produces berries for birds."
    },
    {
        "common": "6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ipomoea",
        "zones": [],
        "benefits": "The Heavenly Blue Morning Glory is a twining, perennial vine with heart-shaped leaves; usually cultivated as a garden annual—bears clusters of bright sky-blue flowers with creamy white throats. May become invasive"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Helenium autumnale",
        "zones": [
            "5",
            null
        ],
        "benefits": "Branching, leafy stems with yellow, orange or reddish Daisy-like flowers in the Fall"
    },
    {
        "common": "3-9",
        "botanical": "",
        "height": [],
        "characteristics": "Heliotropium arborescens",
        "zones": [
            "1",
            "6"
        ],
        "benefits": "Heliotropes are also known by the old-fashioned name of Cherry Pie. They are frost tender, evergreen shrubs that are most often grown as annual bedding plants. Their main attraction is the aroma from their clusters of tiny flowers with the sweet fragrance of vanilla or cherry pie."
    },
    {
        "common": "10-11\n",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Echeveria elegans",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Succulent blue-green clustering rosettes; bell shaped pink flowers in late summer"
    },
    {
        "common": "8-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Sempervivum tectorum",
        "zones": [
            "1",
            "4"
        ],
        "benefits": "Many varieties of succulent rosettes; unique flowers develop after the plant is a couple years old; needs excellent drainage"
    },
    {
        "common": "zones vary",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ilex aquifolium",
        "zones": [
            "50",
            null
        ],
        "benefits": "Holly trees require well-drained, slightly acidic, fertile soil. They can tolerate either sun and shade. The male and female flowers of the holly tree are produced on separate plants. Therefore to ensure berry production, both male and female plants need to be planted."
    },
    {
        "common": "6-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Althaea rosea",
        "zones": [
            "3",
            "7"
        ],
        "benefits": "Hollyhocks are easy to start from seed. The towering spikes host dozens of white, yellow, pink, red or crimson flowers from mid Summer until late Fall"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Malva alcea",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Hollyhock Mallow plants are multi-stemmed, upright perennials that grow 2-4 feet tall, forming 2 foot clumps. From mid summer until fall, they produce spikes of 2\" rose-pink or white flowers that resemble Hollyhocks. Mallow are reliable, easy to care for plants."
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lonicera",
        "zones": [],
        "benefits": "Honeysuckle are easy to grow, vigorous, heat-tolerant, and nearly indestructible. The flashy, fragrant flowers will attract hummingbirds and butterflies all summer long. The resulting fruit will provide a fall treat for your local songbirds as well."
    },
    {
        "common": "4-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Anisacanthus quadrifidus",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Hummingbird Bushes are covered with reddish orange, tube shaped blooms from mid Summer until first frost. They are drought tolerant, heat-loving small deciduous shrubs that Hummingbirds love!"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Veronica austriaca",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Groundcover, Rock Gardens, Borders, Containers\nMound forming evergreen with 1\"-2\", oval, deep green leaves. Six inch spikes of intensely colored, deep blue flowers appear in summer and last for 3-4 weeks."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Dolichos lablab",
        "zones": [],
        "benefits": "The Hyacinth Bean is a fast growing tender perennial that is usually grown as an annual. This twining vine has purplish green foliage, pinkish lavender blooms in summer and fall and purple seed pods in the fall"
    },
    {
        "common": "\n8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Hydrangea macrophylla",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "Hydrangeas need an abundance of water (hydrangea means water tub in Greek), partial to full sun,and very rich soil. Spent Hydrangea flowers should be removed as soon as possible to allow the plant to direct it's strength to growing and producing new buds."
    },
    {
        "common": "8-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Carpobrotus chilensis",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "The Ice Plant is a creeping, mat-forming succulent ground cover from South Africa. 1-2\" magenta flowers, low maintenance, requires good drainage, may become invasive"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lampranthus aurantiacus",
        "zones": [
            "14",
            null
        ],
        "benefits": "This Ice Plant is a winter growing, succulent sub-shrub from South Africa. The flowers are bright and dramatic but they will fail to open without full sun"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Impatiens",
        "zones": [
            "12",
            null
        ],
        "benefits": "Impatiens are colorful, easy to grow annuals that are especially great for adding bright color spots in the shady areas of your garden. Can be grown as a house plant. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": ">\n\n",
        "height": [],
        "characteristics": "Duchesnea indica",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "The Indian Strawberry is not a true strawberry, but it is a rapidly spreading, evergreen ground cover that will survive harsh conditions. The fruit is fairly flavorless but it is edible and plentiful all summer long."
    },
    {
        "common": "6-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Sagina subulata",
        "zones": [
            "1",
            null
        ],
        "benefits": "Irish Moss is an excellent terrarium plant. Mosses grow primarily in lightly shaded areas. Thousands of tiny Moss plants will bunch together to make a single patch of moss."
    },
    {
        "common": "5-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Begonia masoniana",
        "zones": [
            "8",
            "15"
        ],
        "benefits": "Iron Cross Begonias have some of the most unique foliage in the plant world. Each heavily textured, bristly, light green leaf bears a reddish-brown marking resembling the Iron Cross used on shields and flags during the Crusades of medieval times."
    },
    {
        "common": "10-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Anchusa italica",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Italian alkanet is a stout and durable member of the Forget-me-not family. It has hairy 6\" leaves and produces spikes of \"true blue\" flowers in June and July"
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Pelargonium peltatum",
        "zones": [],
        "benefits": "The Ivy Leaved Geranium is a frost tender, climbing and trailing, semi succulent perennial that produces clusters of orchid-like flowers at the vine tips all summer. Good in hanging baskets. They can be propagated by softwood cuttings or grown from seed"
    },
    {
        "common": "\n9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Arisaema species",
        "zones": [
            "12",
            "30"
        ],
        "benefits": "Jack in the Pulpits are distinctive, woodland wildflowers that are native to North America and parts of Asia. In spring to early summer, tiny, insignificant flowers form on the spadix (Jack), hidden down inside the hooded spathe (The Pulpit), which emerges from the middle of the foliage."
    },
    {
        "common": "vary",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Clematis jackmanii",
        "zones": [],
        "benefits": "Abundant, small lavender-pink flowers 6 hours of full sun per day to grow best although some light shading during the hottest part of the day, pruned annually in late winter or very early spring. Clematis like their heads in the sun and their roots in the shade"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Polemonium",
        "zones": [
            "6",
            "36"
        ],
        "benefits": "Clump forming perennials that grow in swirling rosettes of bright green or variegated, fern-like foliage. Produces loose clusters of tubular or bell shaped flowers. Plants go completely dormant in the winter but quickly re-emerge in early spring."
    },
    {
        "common": "2-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Fatsia japonica",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Japanese Aralias are one of the easiest of all shade garden or house plants to grow and care for. They have large dark green, palmate leaves and form tropical looking, evergreen shrubs that can grow up to 6-8 feet tall and 6 feet wide."
    },
    {
        "common": "8-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Iris japonica",
        "zones": [
            "12",
            "24"
        ],
        "benefits": "The foliage of the Japanese Iris resembles that of a Daylily more than of other Iris but the flowers are unmistakably Iris. Japanese Iris produces masses of blooms in late spring"
    },
    {
        "common": "Hardy",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Acer palmatum",
        "zones": [
            "3",
            "20"
        ],
        "benefits": "Japanese Maple trees grow best in a moist, well draining, fertile soil. There are over 300 beautiful and diverse hybrids with a wide range of growing habits and foliage colors and shapes."
    },
    {
        "common": "4-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Pieris japonica",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "The Japanese Pieris, or Lily of the Valley shrub is a nice plant to add to the garden for early spring color. It is a compact, symmetrical, evergreen shrub that has leathery 3-4 inch foliage that emerges coppery-pink, before turning to a deep green. Cascading clusters of small, urn shaped flowers open in February or early March."
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Carex morrowii 'Variegata'",
        "zones": [
            "1",
            null
        ],
        "benefits": "Japanese Sedge Grass is a semi-evergreen vigorous grower that will grow in full shade and even tolerates full sun in cool climates. This sedge is great for growing in container."
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Pachysandra terminalis",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Pachysandra is a very easy to care for, durable, low growing, mat forming, slow spreading ground cover plant that grow on thick, unbranched stems to about 6\" tall in partial shade and 10\" in deep shade."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Athyrium niponicum 'Pictum'",
        "zones": [
            "12",
            "15"
        ],
        "benefits": "The slow spreading Japanese Painted Fern is probably the most decorative of all ferns. The fronds are tri-colored blends of silver, pink and green, standing above burgundy stems. Japanese Painted Ferns should be grown in full shade to partial shade, where soil is moist but well-drained."
    },
    {
        "common": "4-8",
        "botanical": "",
        "height": [],
        "characteristics": "Anemone hupehensis",
        "zones": [
            "12",
            null
        ],
        "benefits": "Spreading ground cover with single 2-3\", white to pink flowers"
    },
    {
        "common": "6-10",
        "botanical": " \n",
        "height": [],
        "characteristics": "Solanum pseudocapsicum",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "The Jerusalem Cherry belongs to a diverse family of plants that includes Nightshade, Cockroach Berries, Horsenettles, Tomatoes, Potatoes and Egg Plants."
    },
    {
        "common": "8-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Centranthus ruber",
        "zones": [
            "24",
            "36"
        ],
        "benefits": "Jupiter's Beard is an upright, branching perennial with soft, light bluish green, lance shaped foliage. It produces clusters of small, fragrant flowers from June through August. Can be easily grown from seeds."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Clivia miniata",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Clivias will bloom better and more consistently when they are pot bound. The seeds MUST be removed from the pods and planted while they are still fresh."
    },
    {
        "common": "10-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dampiera diversifolia",
        "zones": [
            "3",
            null
        ],
        "benefits": "Kangaroo Lobelia is a creeping perennial herb from Australia that produces masses of bright purplish blue flowers in spring and summer. This plant is useful as a ground cover or container plant"
    },
    {
        "common": "8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Cymbalaria muralis",
        "zones": [],
        "benefits": "Kenilworth Ivy is a trailing, creeping vine with small, light green Geranium-like foliage and tiny blue, orchid-like flowers from early summer until first frost. A nice ground cover"
    },
    {
        "common": "3-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Persicaria bistorta",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Knotweed or Bistort plants are low maintenance, quick growing, semi-evergreen perennials with bright green, lance shaped leaves. Knotweed plants produce -bottlebrush-like spikes of tiny, pink, bell-shaped flowers on leafless stems that rise above the foliage from late spring into early fall."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Calamagrostis brachytricha",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "This Feather Reed is a slow spreading, clump forming, narrow foliaged grass that produces plumes of pink flowers in late summer"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Anthyllis vulneraria",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Silky, fern-like foliage mound, with small white or yellow blooms"
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Alchemilla mollis",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Lady's mantle is a clump forming perennial with light green foliage that resembles that of the Geranium except that Lady's Mantle has crinkled edges. Tiny, star-shaped flowers appear in loose clusters in late spring to early summer"
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lantana camara\nLantana montevidensis",
        "zones": [
            "1",
            "4"
        ],
        "benefits": "Lantanas are fast growing, shrubby, spreading or trailing evergreen plants that grow from one to four feet tall. Lantana plants produce flat-topped 2\" clusters of bright, multi-colored tubular flowers in the summer and fall."
    },
    {
        "common": "7-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Consolida ambigua",
        "zones": [
            "1",
            "5"
        ],
        "benefits": "Larkspur is a low maintenance, upright growing annual with many stems of sparsely covered with light green, needle-like foliage topped with a spire of brightly colored flowers throughout the summer. Remove spent blooms to prolong flowering."
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ligularia",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Ligularias are unusual, old world perennials with big leaves with long leaf stalks and unique daisy-like flowers. They are excellent specimen plants for growing in tubs, boggy areas or along the banks of stream or pond. The ideal location for growing most Ligularias is in a bog garden with fertile, humus-rich soil in partial shade."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Doronicum pardaliances",
        "zones": [
            "3",
            null
        ],
        "benefits": "Large heart shaped green foliage with bright yellow Daisy-like flowers from Spring to mid-Summer"
    },
    {
        "common": "5-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Lewisia cotyledon",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "Bitter Root plants produce clusters of 1\" flowers on 10\" stems in shades of white to pink or gold, occasionally with red and white stripes from spring to early summer. Easily hybridized Rock Garden plant. Lewisias can be grown as house plants."
    },
    {
        "common": "5-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Polypodium glycyrrhiza",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Licorice Ferns are attractive, epiphytic plants that are primarily found growing with mosses on rotting logs or in Bigleaf Maple trees. They are fairly difficult to grow without a rotting log to plant them in. Licorice Ferns grow best partial to full shade, but will tolerate very short periods of bright sun. Generally they require moist soil, but they will tolerate brief periods of drought."
    },
    {
        "common": "5-9",
        "botanical": "",
        "height": [],
        "characteristics": "Syringa vulgaris",
        "zones": [
            "5",
            "8"
        ],
        "benefits": "Lilacs require full sun for maximum bloom. They prefer a slightly alkaline soil (pH 7.5). Most Lilacs require a pronounced winter chilling period or they may fail to bloom the following year"
    },
    {
        "common": "3-7",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Sternbergia lutea",
        "zones": [
            "4",
            null
        ],
        "benefits": "Winter Daffodil is neither a daffodil nor a crocus, however, it is in the amaryllis family. Plant in well-draining gravelly soil"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Agapanthus praecox",
        "zones": [
            "18",
            "36"
        ],
        "benefits": "The Lily of the Nile is a tuberous rooted, clump-forming tender perennial with deep green, arching, strap like leaves.\nIn mid summer to early fall, they produce rounded, 3\" starburst flower heads. Agapanthus don't like their roots disturbed so in colder regions they should be grown in planters."
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Convallaria majalis",
        "zones": [
            "5",
            "6"
        ],
        "benefits": "Lily of the Valley bulbs will bloom in just 3-4 weeks if potted up at 65°. In the garden, Lily of the Valley's sweetly scented flowers bloom in early spring. They like partial to full shade and are perfect for your shade garden."
    },
    {
        "common": "Hardy",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Liriope muscari",
        "zones": [
            "18",
            null
        ],
        "benefits": "Lily Turf are relatively slow spreading plants that eventually form large, 24\"-30\" wide clumps of loose, 18\" tall, ½\" wide leaves. Lily Turf plants form 6\"-8\", spike like clusters of ¼\", white or purple flowers in late summer."
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Carex comans 'Frosted Curls'",
        "zones": [
            "1",
            null
        ],
        "benefits": "Frosted Curls produces compact clumps of fine silvery green foliage with curly ends. It is deer resistant plant and will tolerate wet conditions"
    },
    {
        "common": "7-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Aeschynanthus radicans",
        "zones": [],
        "benefits": "Lipstick Plants have thick, glossy, dark green leaves growing in pairs along their long, woody stems. Each vine is tipped with clusters of 2\" tubular, scarlet red flowers emerging from maroon calyxes in mid-summer."
    },
    {
        "common": "11-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Eustoma grandiflorum",
        "zones": [
            "8",
            "24"
        ],
        "benefits": "Lisianthus are biennial or short lived tender perennial wildflowers that are native to the high prairies from the southwest part of the United States to northern South America. Lisianthus form small clumps of sturdy, upright, 18\"-24\" stems topped with a cluster of 2\"-3\", bell shaped flowers."
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lithodora prostrata",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "A fuzzy foliaged, creeping form of Lithodora. It is useful as a ground cover and for border plantings. It produces masses of deep blue (sometimes bi-color), star shaped flowers in early Spring"
    },
    {
        "common": "6-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lithodora diffusa",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Lithodora is a fuzzy foliaged, evergreen mini-shrub that is useful as a ground cover and for border plantings. It produces masses of deep blue (sometimes bi-color), funnel shaped flowers in early Spring"
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Schizachyrium scoparium",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Little Bluestem Grass forms dense clumps of fine textured foliage. The flower stem will grow to 30\" tall before displaying its burgundy flower spray. Little Bluestem is a larval host for many species of butterflies and provides nesting material and seed for birds."
    },
    {
        "common": "3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lotus maculatus",
        "zones": [],
        "benefits": "The Lotus Vine is a semi hardy hanging or ground crawling vine that is most often grown as an annual plant. The foliage consists of fine, 1-2\", silvery blue needle like leaves. Produces lots of bright, 'parrot beak' shaped flowers in late spring and early summer. Excellent for hanging baskets or to cascade down a rockery"
    },
    {
        "common": "\n9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lupinus",
        "zones": [
            "12",
            "36"
        ],
        "benefits": "Lupines are upright, mound forming annual or perennial wildflowers with large green, lance shaped leaves and spikes of brightly colored sweet pea-like flowers from June to August. Can be easily grown from seed Beware of slugs!"
    },
    {
        "common": "\n3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Alyssum spinosum",
        "zones": [
            "24",
            null
        ],
        "benefits": "Compact shrub-like growth, tiny foliage, profusion of small white to pink flowers"
    },
    {
        "common": "8-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Miscanthus sinensis",
        "zones": [
            "5",
            "6"
        ],
        "benefits": "Maiden grass forms a nice rounded clump of fine textured foliage and a graceful, rounded form. Plumes of flowers on 7 foot stalks in the Fall"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Adiantum raddianum",
        "zones": [
            "12",
            null
        ],
        "benefits": "Delta Maidenhair Ferns are elegant, fast growing, evergreen foliage plants with delicate, lacy fronds that are held on wiry, 6\"-12\" black stems. Maidenhair fronds are composed of bright green, triangular leaflets and can grow up to 12\" wide and 18\" long."
    },
    {
        "common": "10-12",
        "botanical": "\n",
        "height": [],
        "characteristics": "Asplenium trichomanes",
        "zones": [
            "4",
            "7"
        ],
        "benefits": "The Maidenhair Spleenwort is a rhizomous, low growing, creeping fern that forms dense tufted rosettes of deep green fronds on black, wire-like stems. In nature, Maidenhair Spleenworts grow in shady rock cervices and rocky, calcium rich (limestone) soil. They require constant moisture and good drainage."
    },
    {
        "common": "3-9",
        "botanical": "",
        "height": [],
        "characteristics": "Argyranthemum frutescens",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "Marguerite Daisies are easy to grow, tender perennials that are usually grown as annual plants. They produce masses of fragrant, 1-2\", Chrysanthemum-like flowers from mid spring until mid fall that attract many types of butterflies"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tagetes",
        "zones": [
            "8",
            "36"
        ],
        "benefits": "Marigolds are one of the easiest of all plants to grow and care for, making them a perfect plant for teaching young children about growing and gardening. These spunky little plants are only hardy in zones 9-11 so they are normally grown as annual bedding plants."
    },
    {
        "common": "9-11\n",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Astrantia maxima",
        "zones": [
            "18",
            "30"
        ],
        "benefits": "Masterworts have bright green, palmate leaves with 5-7 fingers. From early to mid-summer, they produce wirey, top-branched stems with intricately formed, ¾\"-1¼\" umbels of tightly packed, 5 petaled flowers, surrounded by a ring of papery, petal-like bracts."
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Geranium pratense",
        "zones": [
            "36",
            null
        ],
        "benefits": "Shiny green foliage turns bronze in the Fall, 1\" saucer shaped flowers in mid-summmer"
    },
    {
        "common": "5-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Thalictrum aquilegifolium",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Meadow Rue plants are mound forming perennials that will grow to about three feet tall and spread to about 18\". They are known for their lacy, bluish green foliage that closely resembles that of the Columbine plant.\nA great addition to any Butterfly garden"
    },
    {
        "common": "5-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Salvia nemorosa",
        "zones": [
            "3",
            null
        ],
        "benefits": "Narrow erect plant with irregular leaves, spikes of small purple to white blooms in the Summer. Prefers slightly alkaline soil"
    },
    {
        "common": "5-10",
        "botanical": "  \n\n",
        "height": [],
        "characteristics": "Erigeron karvinskianus",
        "zones": [
            "6",
            "15"
        ],
        "benefits": "Mexican Daisies are a readily trailing perennial that produce abundant white daisy-like flowers that turn to pink as they age. Excellent as a ground cover or in rock gardens"
    },
    {
        "common": "8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Stipa tenuissima",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Mexican Feather Grass forms compact clumps of fine, thread-like foliage. Produces a a profusion of feather-like, yellowish green flower panicles all summer. Deer resistant"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Asclepias speciosa",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Milkweed is a deciduous American wildflower with large, wooly, grayish green leaves. They produce clusters of brightly colored, uniquely shaped flowers from late spring until late summer which turn into large, pointed seed pods"
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Campanula lactiflora",
        "zones": [
            "2",
            "5"
        ],
        "benefits": "Large clumping plant with tall spikes of bell shaped purple/blue flowers in Summer"
    },
    {
        "common": "5-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Albizia julibrissin",
        "zones": [
            "20",
            "30"
        ],
        "benefits": "The Mimosa Tree is a short lived, fast growing, multi stemmed deciduous tree with fine, compound, fern like foliage. It produces clusters of fragrant, feather-ball flowers in the summer, followed by brownish seed pods"
    },
    {
        "common": "6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Bellium mimutum",
        "zones": [
            "2",
            null
        ],
        "benefits": "The Miniature Daisy plant is a vigorous growing, mat forming perennial with dense, bright green, 1\" spoon shaped foliage. They only grow 2\" tall, but spread to about 18\". From late spring through summer, they cover themselves with tiny, ½\" Daisy flowers on wirey stems."
    },
    {
        "common": "6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Mentha",
        "zones": [
            "6",
            "24"
        ],
        "benefits": "Mint plants are fragrant, easy to grow, sometimes invasive, drought tolerant perennials that range from low growing ground covers to two foot uprights. Flowers should be snipped away to strengthen the stems."
    },
    {
        "common": "3-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Campsis x tagliabuana",
        "zones": [],
        "benefits": "Mme. Galen's Trumpet Creeper is a cross between Campsis radicans and Campsis grandiflora with large dark green serrated leaves and bright reddish orange flowers. t thrives in poor soil and in partial shade"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Philadelphus virginalis",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "Mock Orange thrives in full sun or light shade, in almost any soil, but they grow and bloom best in moist, well-drained soil. It needs to be pruned immediately after flowering by cutting back the outer stems that have bloomed"
    },
    {
        "common": "4-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ophiopogon japonicus",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Mondo grass slowly forms tight, 24\" matted clumps of 8\"-12\" long, 1/8\" wide, bright green, grass-like foliage.\nSpikes of small, lavender or light purple flowers appear in the late summer"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Mimulus hybridus",
        "zones": [
            "1",
            null
        ],
        "benefits": "The Monkey Flower is a colorful, easy to grow addition to the shaded areas of your garden. This plant grows well in containers and can be grown as a house plant"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Aconitum napellus",
        "zones": [
            "3",
            null
        ],
        "benefits": "Monkshood closely resembles Delphiniums in both foliage and flower. It has deeply divided green foliage and tall spikes of dark blue, purple or white flowers"
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Crocosmia",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Crocosmia are easy to grow, corm type plants that are related to the Iris. They produce a stalk of brilliantly colored, tube shaped flowers that open sequentially up the stem from July until the first hard frost. They can be grown, but not over-wintered in containers"
    },
    {
        "common": "5-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Molinia arundinacea",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Moon Grass forms large upright, compact clumps of dark green foliage that turns gold in the Fall. Showy seven foot spikes of translucent maroon flowers at mid-summer"
    },
    {
        "common": "4-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Molinia caerulea",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Moor grass is slow to get established, bit its compact foliage makes it a perfect ground cover plant for wet, acidic soil. Suitable for growing in a planter."
    },
    {
        "common": "5-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ipomoea species",
        "zones": [
            "10",
            "20"
        ],
        "benefits": "Morning Glories are very fast growing vines that are capable of growing 10 feet or more within the first two months. They readily reseed themselves for the next year.\nMorning Glory vines may become invasive"
    },
    {
        "common": "\n9-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Many Species",
        "zones": [
            "1",
            null
        ],
        "benefits": "Mosses grow naturally in most temperate areas of the world. They are primarily found growing in lightly shaded areas or where there are periods of sun in the morning or late afternoon. Very usable for creating a terrarium!"
    },
    {
        "common": "1-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Silene schafta",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Semi-evergreen clump of hairy, tongue shaped leaves, solitary purplish/red flowers appear on wirey stems in late Summer and Fall"
    },
    {
        "common": "6-10",
        "botanical": " \n",
        "height": [],
        "characteristics": "Portulaca Grandiflora",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "Moss Rose is a quick growing succulent annual. Portulaca seeds should be sown outside after your last frost has passed. Seeds will germinate within 10-15 days."
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dryas drummondii",
        "zones": [
            "4",
            null
        ],
        "benefits": "Mat of dark green, Oak-like leaves; 1 1/2 inch white flowers in early Summer"
    },
    {
        "common": "2-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Centaurea montana",
        "zones": [
            "24",
            "36"
        ],
        "benefits": "The Mountain Cornflower is an easy to grow, upright perennial which forms large clumps which typically reach three feet tall. It begins producing it's bright flowers in late spring and will often continue blooming well into fall."
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Clarkia elegans",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "The Mountain Garland is a fast growing, easy care annual plant that produces an abundance of bright, double flowers on tall wispy stems. Excellent for cut flowers. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lewisia tweedyi",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "Rosettes of fleshy 3-6\" evergreen leaves; satiny peach-pink flowers from Spring to Summer; requires perfect drainage"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Veronica montana",
        "zones": [
            "3",
            "12"
        ],
        "benefits": "Groundcover, Rock Gardens, Borders, Containers\nSpreading, mound forming groundcover with small, variegated, cream and green leaves with scalloped edges. Produces small clusters and tiny lilac flowers in late spring into early summer."
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tropaeolum majus",
        "zones": [],
        "benefits": "Once established, Nasturtiums take little or no care. As they spread and grow, their foliage resembles a sea of tiny lily pad leaves topped with brightly colored, edible blossoms. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Carissa macrocarpa",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "Natal Plum is a quick growing tender shrub with thick, shiny, oval 1-2\" leaves. The fruit is edible, but the leaves contain toxic sap. Thorns along the stems."
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Nemesia strumosa",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "Nemesias are brightly colored annual plants that quickly grow to a height of 12 inches. Nemesias grow well in hanging baskets and planters"
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Acaena buchananii",
        "zones": [
            "1",
            "4"
        ],
        "benefits": "New Zealand Burr plants quickly spread to create a dense mat of evergreen, coppery purple foliage."
    },
    {
        "common": "7-10",
        "botanical": "",
        "height": [],
        "characteristics": "Rosa nutkana",
        "zones": [
            "4",
            "10"
        ],
        "benefits": "Native Americans of the Pacific Northwest used this fragrant Wild Rose to create a tea which was used to enhance eyesight. Mashed (or chewed up) leaves can be used as a remedy for bee stings"
    },
    {
        "common": "4-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Araucaria heterophylla",
        "zones": [
            "6+",
            null
        ],
        "benefits": "The beauty and symmetry as well as the soft flowing texture of the foliage will make you want to decorate your Norfolk Pine and use it as a living Christmas tree!"
    },
    {
        "common": "10-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Gymnocarpium dryopteris",
        "zones": [
            "5",
            "12"
        ],
        "benefits": "Oak Ferns spread by non-aggressive, underground rhizomes forming a nice delicate looking ground cover in your woodland setting. Oak ferns should be grown in evenly moist, compost rich soil and planted where it will grow in partial to full shade."
    },
    {
        "common": "3-9",
        "botanical": "",
        "height": [],
        "characteristics": "Carex testacea",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "The fine orangish-brown foliage of the Orange New Zealand Sedge is unpopular with some gardeners who think it makes the plant look dead. Deer resistant"
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ornithogalum dubium",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "The Orange Star Plant is a bulb type plant that produces upright clusters of fragrant 1-2\" flowers in early summer. Can be grown in containers or as a House Plant"
    },
    {
        "common": "9-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Origanum amanum",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Evergreen, small heart shaped green leaves; funnel shaped pink flowers mid-summer"
    },
    {
        "common": "8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Mahonia aquifolium",
        "zones": [
            "3",
            "6"
        ],
        "benefits": "Oregon Grape is a deer resistant, low maintenance, durable, evergreen shrub with glossy green, holly like foliage. It produces spiked clusters of Butterfly attracting, bright yellow flowers in the spring, followed by bluish-black berries to feed the birds."
    },
    {
        "common": "5-9",
        "botanical": "",
        "height": [],
        "characteristics": "Papaver orientale",
        "zones": [
            "18",
            "36"
        ],
        "benefits": "Poppy plants form 18\"-36\" tall clumps of deeply divided green leaves that are covered with fine bristles. These undemanding perennials slowly spread by rhizomes to form nice two to three foot colonies. Their flowers have the texture of silky crepe paper."
    },
    {
        "common": "3-7",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Brassica oleracea",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "Ornamental Kale will not tolerate summer heat. These plants are very showy, and come in a variety of colors, ranging from white to pinks, purples or reds, extremely cold-tolerant"
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Oenothera missouriensis",
        "zones": [
            "3",
            "10"
        ],
        "benefits": "The Ozark Sundrop is an easy to grow trailing plant that will grow 6\"-10\" tall and form a 24\" clump. This night blooming plant will produce a succession of short lived blooms from late spring until mid summer if the dead flowers are removed promptly."
    },
    {
        "common": "4-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Adiantum pedatum",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "The Pacific Maidenhair Fern can add a bit of graceful elegance to any partial to fully shaded area of your garden. The fronds emerge in early spring on black, wire-like stems that reach 18-24 inches. Your Pacific Maidenhair should be planted in a rich, humus soil and provided with constant, even moisture."
    },
    {
        "common": "3-8",
        "botanical": "",
        "height": [],
        "characteristics": "Coleus blumei",
        "zones": [
            "8",
            "24"
        ],
        "benefits": "Coleus plants are durable and easy to grow. They are best known for their bright colors, and variety of foliage forms"
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Carex muskingumensis",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Palm Sedge has an interesting whorling habit to its growth. The tips of the light green foliage branch to resemble tiny Palm trees. Deer resistant"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Cortaderia selloana",
        "zones": [
            "8",
            "10"
        ],
        "benefits": "Pampas Grass is an impressive, fast growing plant due to its size and durability as well as its large plumes of showy white to pink flowers (Cortaderia selloana 'Rosea'). Once it becomes well established, it is very drought tolerant and nearly indestructible plant."
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pratia angulata",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "Panakenake is known by many names including Creeping Pratia. It is a fast growing, spreading, fine foliaged ground cover from New Zealand. It will be covered with small flowers from early spring until fall."
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Viola",
        "zones": [
            "3",
            "8"
        ],
        "benefits": "Pansies may be cool season annuals, biennials, or hardy perennials. They may bloom in early spring or fall depending on the species. Planting time is critical"
    },
    {
        "common": "\n6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pulsatilla vulgaris",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "In early spring, Pasque Flower plants produce large, 3\"-4\", violet purple, pink or sometimes white flowers with bold, contrasting yellow centers which, as they begin to fade, are followed by finely dissected, silvery green, fern-like foliage.\n"
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Passiflora incarnata",
        "zones": [],
        "benefits": "Passion flowers are generally considered to be hardy in USDA zones 5-9 but they should be planted in a protected location and mulched heavily if severe cold threatens. This vine produces dramatic 3 inch diameter flowers in late summer"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Spathiphyllum floribundum",
        "zones": [
            "18",
            "36"
        ],
        "benefits": "Peace lilies are tender perennial plants, usually grown as house plants. They will grow and flourish in almost any well drained soil. They prefer bright filtered light, but will survive in low interior light."
    },
    {
        "common": "10-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Paeonia lactiflora",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "Peony clumps may survive for up to as long as 50 years, so it is advisable to prepare the site very thoroughly before planting. Once they have become established in the garden, they are reasonably free from maintenance and problems. Peonies can be propagated by division"
    },
    {
        "common": "3-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Vinca",
        "zones": [
            "6",
            null
        ],
        "benefits": "Periwinkles are fast growing, evergreen ground cover plants with opposing pairs of glossy dark green or variegated, oblong to lance shaped, 1½\"-3\" leaves. They produce an abundance of single, 1\"-2\" funnel shaped flowers with five flared and flattened petals."
    },
    {
        "common": "4-9\n7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ranunculus asiaticus",
        "zones": [
            "8",
            "18"
        ],
        "benefits": "Persian Buttercups provide a continuing display of beautiful 3\"-5\" Camellia-like flowers atop branched, 8\"-18\" stems, from late spring through mid summer. They are well suited plants for growing in planters"
    },
    {
        "common": "\n8-10",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Petunia hybrida",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Petunias have long been the most popular flowering annual for planting in hanging baskets, window boxes and for border plantings. There are many single and double flowering varieties available. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Phlox subulata",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "Mat growing fine foliage with masses of 1 inch, fragrant, star shaped flowers (white, blue, pink or red) in Spring"
    },
    {
        "common": "3-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Alstroemeria",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Peruvian Lily plants are easy to care for, tuberous rooted perennials with bright green, lance shaped foliage that grow 2-3 feet tall. They produce loose clusters of speckled, 1½\"-2\" Azalea-like flowers on long, leafy stems in late spring into mid summer."
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Scabiosa columnaria",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "The Pincushion Flower is a long blooming, clump forming perennial. From early summer until the first frost of fall, Pincushion Flowers produce an abundance of rounded, 1½\" flowerheads on top of wirey, 12\"-24\" stems."
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Nertera granadensis",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "The Pin Cushion Plant is a fast growing tropical plant that produces an abundance of tiny orange berries just in time for halloween. Pin cushions require full sun or they will produce a lot of foliage and very few berries"
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Penstemon pinifolius",
        "zones": [
            "10",
            "18"
        ],
        "benefits": "The Pineleaf Penstemon blooms for 6-10 weeks in mid summer. The dark orange flowers, will attract hummingbirds from miles around"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Hosta",
        "zones": [
            "9",
            "24"
        ],
        "benefits": "Decorative, large clumps of lush foliage and spikes of lily shaped flowers later in summer. A hummingbird favorite flower"
    },
    {
        "common": "3-9",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Epipremnum aureum",
        "zones": [],
        "benefits": "Golden Pothos are one most popular of all house plants. They are attractive, durable and easy to grow vines that have smooth, leathery, heart shaped leaves with distinctive marbling. Pothos vines are among the top ten air purifying plants for indoor use."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Corydalis scouleri",
        "zones": [
            "3",
            null
        ],
        "benefits": "Corydalis scouleri is a perennial wildflower that is native to western Washington, Oregon and parts of southwestern British Columbia. Scouler's Corydalis will gradually form a 3 foot clump of 3 foot stems of light green, lace-like foliage. Spikes of hot pink, tubular flowers appear in late spring and continue into summer."
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Aeonium haworthii",
        "zones": [
            "18",
            null
        ],
        "benefits": "Medium sized succulent that form rosettes of waxy blue-grey rosettes tinged in red"
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Sarracenia",
        "zones": [
            "4",
            "3"
        ],
        "benefits": "These prehistoric looking plants are characterized by leaves that curve into tubular funnels which catch and digest insects."
    },
    {
        "common": "6-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Hosta",
        "zones": [
            "9",
            "24"
        ],
        "benefits": "Decorative, large clumps of lush foliage and spikes of lily shaped flowers later in summer. A hummingbird favorite flower"
    },
    {
        "common": "3-9",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Plecostachys serpyllifolia",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Plecostachys is a sturdy and drought tolerant, low growing shrub from South Africa. It has dense, very fine textured, light green or light gray foliage and produces Yarrow like flowers from mid summer to early fall"
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Plumbago",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Plumbago is a semi-tender perennial, evergreen shrub that produces Clusters of phlox-like light blue flowers on new growth throughout the year. Can be trained to cover trellises or fences and may be grown in containers. Prune in late winter"
    },
    {
        "common": "8-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Calceolaria",
        "zones": [
            "6",
            "15"
        ],
        "benefits": "There are about 300 species of Calceolaria, but the vast majority of those commonly cultivated are hybrids of the Chilean species Calceolaria crenatiflora. They are commonly known as Pocketbook Plants, Pouch Flowers or Slipper Flowers."
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Euphorbia pulcherrima",
        "zones": [
            "1",
            "8"
        ],
        "benefits": "Poinsettias are perennials, so it's possible to keep them growing from year to year. In order to get them to produce their flower bracts again next December, they must be kept at 50 degrees and kept in total darkness for 14 hours per day beginning in mid September."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Hypoestes phyllostachya",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Originally Polka Dots were known for the bright pink spots which covered their dark green foliage. Now you can also find hybrids with bright red or white spotting."
    },
    {
        "common": "\n10-11",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Schizanthus wisetonensis",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "The colorful orchid like flowers of the Butterfly Flower contrast beautifully against the soft, feathery foliage of this annual. Schizanthus dislike extremes of heat or cold, preferring cool and moist conditions."
    },
    {
        "common": "",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Populus canadensis",
        "zones": [
            "30",
            null
        ],
        "benefits": "Poplars must be planted with caution because of the invasive tendencies of the roots. They should never be planted nearer than 30 ft. from buildings, paving or drains. Useful for wind breaks"
    },
    {
        "common": "4-9",
        "botanical": " ",
        "height": [],
        "characteristics": "Calliandra haematocephala",
        "zones": [
            "3",
            "10"
        ],
        "benefits": "Calliandra haematocephala, commonly known as the Powder Puff Tree grow up to 10 feet tall with an equal spread, but dwarf, 3-6 foot varieties are also available, which are more appropriate in colder regions where you will need to over-winter your plant indoors."
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Artemisia 'Powis Castle'",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Powis Castle Artemisias are shrubby, mound forming perennials are grown for their finely dissected, aromatic, silvery-blue foliage. Powis Castle plants are evergreen (eversilver?) in warm winter regions. They form soft mounds that grow 2-3 feet tall and wide."
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Primula",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Hundreds of species and varieties suitable for a wide range of garden uses. Dwarf varieties are best for rock gardens"
    },
    {
        "common": "vary",
        "botanical": "\n",
        "height": [],
        "characteristics": "Echinacea purpurea",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Purple Coneflowers produce large, fragrant pink flowers beginning in April and May. The three to five foot flower stalks make them an excellent background planting for your landscape, or in a butterfly garden."
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Pennisetum setaceum",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Purple Fountain Grass forms tufts of short, rigid stems topped by long, bronze colored blades of grass. 12\" purplish pink flower spikes. Often grown as an annual"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ligustrum vulgare",
        "zones": [
            "4",
            "15"
        ],
        "benefits": "Privet is a densely growing deciduous shrub with small light green, mottled or golden foliage. It produces clusters of fragrant white flowers all summer. Can be pruned into elaborate shapes"
    },
    {
        "common": "1-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Verbascum phoeniceum",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Dark green rosette, purple or pink flowers form on low spikes in the Summer"
    },
    {
        "common": "6-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Gynura aurantiaca",
        "zones": [],
        "benefits": "The Purple Passion Plant is a trailing, tender perennial which originated in Indonesia. It's primary use is in hanging baskets as a houseplant. The vines may grow to 8 feet long but will tend to lose their bright purple coloring if they reach this length. Easily propagated by softwood cuttings"
    },
    {
        "common": "10-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Linaria purpurea",
        "zones": [
            "3",
            null
        ],
        "benefits": "Gray/green foliage with spikes of small violet colored, Snapdragon-like flowers in the Summer"
    },
    {
        "common": "6-10",
        "botanical": " \n",
        "height": [],
        "characteristics": "Salix discolor",
        "zones": [
            "5",
            "20"
        ],
        "benefits": "Pussy willows grow well in almost any soil but it is a good idea to supplement it with peat moss, leaf mold or compost. Male flowers are yellow, female flowers are white."
    },
    {
        "common": "4-8",
        "botanical": " \n",
        "height": [],
        "characteristics": "Briza media",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Quaking Grasses are relatively disease and pest free. It produces tiny purple, orchid-like flowers"
    },
    {
        "common": "5-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Chrysothamnus nauseosus",
        "zones": [
            "4",
            "5"
        ],
        "benefits": "Rabbitbrush is best known for it's intensely yellow colored flowers which bloom from August through October."
    },
    {
        "common": "4-6",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Leucothoe fontanesiana",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Rainbow Leucothoe is an easy to care for, slow growing, 3-5 ft. multi-stemmed evergreen shrub, with glossy, variegated 3-4\" leaves. Good as an accent plant or for boggy areas."
    },
    {
        "common": "5-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Saccharum ravennae",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "Ravenna Grass is often called Hardy Pampas Grass because of their similarities. It forms a large clump of ¾ wide grayish green blades. Pinkish flower spikes may reach 12 ft. Avoid fertilizing and excess watering to keep the plant compact"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Trifolium pratense",
        "zones": [
            "10",
            "20"
        ],
        "benefits": "Red Clover is a legumous, nitrogen fixing, frost tender perennial with light green, trifoliate leaves immediately below a globe type flower head. It blooms from late spring until mid fall. An excellent cover crop."
    },
    {
        "common": "6-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Persicaria microcephala",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "The Red Dragon Fleeceflower is a fast growing, low maintenance, spreading perennial that grows 2-3 feet tall, with a 3 foot spread. They are known for their bright red stems and stunning, 3\"-4\", lance shaped, deep burgundy leaves. The sprays of tiny, white flowers and the foliage are both useful in cut flower arrangements."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Kniphofia uvaria",
        "zones": [
            "2",
            "5"
        ],
        "benefits": "The stately flowers of the Torch Lily, Kniphofia uvaria provide a dramatic display, when grown in a space where the entire plant is visible.\nIf you have sufficient space, you can select varieties to provide bloom during every month from May through October!"
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Cephalophyllum speciosum",
        "zones": [
            "5",
            null
        ],
        "benefits": "Red Spike Ice Plant is a clustering (to 18\") succulent ground cover. It will produce two inch red flowers in winter and early spring. Requires well draining soil"
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Cornus stolonifera",
        "zones": [
            "15",
            null
        ],
        "benefits": "The Red Twig Dogwood is native to most of the northern United States and Canada. The white blooms appear in the Spring, white berries appear in late summer and provide a treat for the birds, then in the fall the foliage turns to a deep crimson red."
    },
    {
        "common": "3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Enkianthus campanulatus",
        "zones": [
            "10",
            null
        ],
        "benefits": "Redvein Enkianthus are deciduous shrubs known for their small, densely clustered, lightly scented bell shaped flowers that appear in late spring and the layered effect of their small, stiff, bluish-green leaves. In the fall, the foliage turns to shades of yellow, orange or red."
    },
    {
        "common": "6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Rhododendron",
        "zones": [
            "5",
            null
        ],
        "benefits": "Rhododendron 'Blitz' has deep red, trumpet shaped flowers in late May. Rhododendrons must be grown in an acid soil, with a pH of 5.0 to 6.5. They will not tolerate lime."
    },
    {
        "common": "2-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Rhododendron",
        "zones": [
            "5",
            null
        ],
        "benefits": "Rhododendron 'Purple Splendour' has deep purple flowers with black blotching in late May. Rhododendrons must be grown in an acid soil, with a pH of 5.0 to 6.5. They will not tolerate lime."
    },
    {
        "common": "2-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Rhododendron 'Wren'",
        "zones": [
            "12",
            null
        ],
        "benefits": "Low growing, mounding miniature Rhododendron with bright yellow flowers"
    },
    {
        "common": "3",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Phalaris arundinacea",
        "zones": [
            "3",
            null
        ],
        "benefits": "Ribbon grass can quickly become invasive if it is not controlled or grown in a a container. It can be planted directly in your pond or added to your bog garden. Variegated green and white foliage"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Arabis sturii",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Rockcress is a mound forming, easy plant to grow. The small green leaves are usually jagged and sometimes hairy. Good for rock gardens or as a ground cover plant"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Pleione bulbocodioides",
        "zones": [
            "3",
            null
        ],
        "benefits": "Produces a single 3 inch orchid flower in early Spring, followed by a single 6 inch leaf; tough to grow, but very rewarding"
    },
    {
        "common": "8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Corydalis scouleri",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "Rock Harlequin prefers moist, shaded areas but is occasionally found growing on a rocky hillside."
    },
    {
        "common": "7-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Androsace sarmentosa",
        "zones": [
            "4",
            null
        ],
        "benefits": "Small green leaves with silver hairs; pink flowers from April to June"
    },
    {
        "common": "3-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Malephora lutea",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "The Rocky Point Ice Plant is a fast growing, very succulent ground cover from South Africa. In extremely hot regions it should be planted in partial or light shade to avoid sun burn"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Rodgersia aesculifolia",
        "zones": [
            "18",
            "30"
        ],
        "benefits": "The Fingerleaf Rodgersia is a large, imposing, moisture loving plant that will stand out, no matter where you plant it in your garden. Rodgersias produce their long lasting, fluffy plumes of tiny, star shaped, light pink or white flowers beginning in late spring and continuing until mid summer."
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Ceropegia woodii",
        "zones": [],
        "benefits": "The vines of the Rosary plant are like thin wires with marbled, heart shaped leaves. They will reach two to four feet in length. The slender flowers resemble an inverted, small pink vase. The end of the tube is partly closed by delicate purple bars. Do not over-water! Usually grown as a house plant"
    },
    {
        "common": "10-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Daphne cneorum",
        "zones": [
            "1",
            null
        ],
        "benefits": "Rose Daphne is a fragrant, low growing evergreen shrub which blooms prolifically in the spring and occasionally again in the summer. It is excellent as a ground cover or foreground planting"
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Hibiscus moscheutos",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "Hardy Hibiscus are upright growing, multi stemmed perennial plants with light green, 6-8 inch leaves that have a fuzzy underside. Dramatic 5\"-12\" flowers appear in late summer. Rose Mallow does not like to be moved once it has become established"
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Rosmarinus officinalis",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "Rosemary is a tender evergreen shrub which does best with at least four hours of direct sunlight each day. In warm climates, rosemary should be planted outdoors in well-drained soil and full sun, spacing plants 2 to 3 feet apart. In cold climates, grow your rosemary plant in a pot so it may be brought indoors during winter, where it should be placed in a sunny window or under flourescent grow lights."
    },
    {
        "common": "8-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Hydrangea aspera",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "Hydrangea aspera will grow 10 to 12 feet tall with an 8-10 foot spread. This deciduous shrub has very large leaves that are grayish with a fuzzy texture on the top, and light green below. In the summer and early fall, they produce large, 10\"-12\", flattened flower heads."
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Anemonella thalictroides",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "The slow growing Rue Anemone is a slow growing, tuberous, woodland wildflower. It produces dainty pink blooms with the first wave of wildflowers in the spring."
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Salvia officinalis",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Sage is a short lived evergreen shrub with fuzzy, grayish green leaves. Camphor scented, purplish blue flowers appear in mid-summer. Sage is used in cooking, cosmetics and herbal remedies"
    },
    {
        "common": "5-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Gaultheria shallon",
        "zones": [
            "2",
            "8"
        ],
        "benefits": "Salal is a deer resistant, low growing shrub that prefers partial shade and well draining, acidic soil. It has thick, leathery, dark green foliage and spikes of small bell flowers in the spring and edible purple berries in the fall"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Arenaria montana",
        "zones": [
            "6",
            null
        ],
        "benefits": "Sandwort forms a mossy looking, mounding mat of deep green foliage. It produces a mass of small 1\" flowers in late spring. Good for rock gardens or as a ground cover"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Saxifraga bronchialis",
        "zones": [
            "8",
            null
        ],
        "benefits": "Saxifrage is an evergreen perennial that forms cushions of moss-like fine foliage and produces pretty, cream colored flowers spotted with red or pink all Spring"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Salvia splendens",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Scarlet Sage is a frost tender perennial that is usually grown as an annual. It blooms in various colors including scarlet, purple, orange, lavender and yellow. Remove old flowers for repeat blooms."
    },
    {
        "common": "",
        "botanical": " \n\n",
        "height": [],
        "characteristics": "Scilla siberica",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Scilla are bulbous perennial plants that is evergreen where hardy. Leaves are lance-shaped, upright and fleshy. It produces spikes of blue bell-shaped flowers in the spring."
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Calluna vulgaris",
        "zones": [
            "6",
            "36"
        ],
        "benefits": "Heather is a compact, shrubby, evergreen ground cover plant from Northern Europe that covers itself with spires of tiny, brightly colored bell-shaped flowers from late summer through fall."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Eryngium bourgatii",
        "zones": [
            "1",
            null
        ],
        "benefits": "Sea Holly is a uniquely ornamental perennial plant that is among the favorites of many varieties of butterfly. The prickly foliage of this plant is variegated green and white. The steel blue, thistle like flowers form atop a two foot spike."
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Armeria maritima",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "Sea Pink is a low maintenance, short lived perennial that forms a compact mound of narrow, dark green, grass-like leaves. It produces a steady supply of white to pink flowers from late spring until late summer"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Sedum telephium",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "Sedum Autumn Joy is a low maintenance, clump forming, succulent perennial plant with waxy, gray green foliage. Four inch clusters of tiny, star shaped flowers appear from mid summer until mid autumn"
    },
    {
        "common": "3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Prunella laciniata",
        "zones": [
            "3",
            "6"
        ],
        "benefits": "Self Heal is a low growing, creeping perennial which is useful in rock gardens or as a ground cover. The plant will produce an abundance of 8-12 inch spikes of white, pink or purple blossoms from May through July."
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Oxalis",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Several species like the Silver Shamrock are very well behaved and make great additions to the garden. Shamrocks are easy to grow in pots and planters. Many can be grown as house plants"
    },
    {
        "common": "vary",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dodecatheon pulchellum",
        "zones": [
            "6",
            "18"
        ],
        "benefits": "Primrose-like rosette plant with unique flowers in shades from white to purple. Prefers light shade."
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Drosanthemum floribundum",
        "zones": [
            "6",
            null
        ],
        "benefits": "The Showy Dewflower is a slow spreading ground cover from South Africa. The succulent foliage is grayish green. The brightly colored flowers persist throughout the summer. May become invasive if not contained"
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Brunnera macrophylla",
        "zones": [
            "15",
            "24"
        ],
        "benefits": "10\" tall and 20\" wide mounds of light green, heart shaped leaves, with clusters of tiny violet-blue 'forget-me-not' flowers on wirey stems in late spring"
    },
    {
        "common": "3-7",
        "botanical": " \n",
        "height": [],
        "characteristics": "Iris siberica",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Siberian Irises are very durable and extremely hardy. They typically bloom in late May and into June. Siberian Iris should be divided every 3-4 years to ensure a quality show of blooms."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Eleagnus commutata",
        "zones": [
            "8",
            "15"
        ],
        "benefits": "Silverberry is a trouble free, very spiny evergreen shrub with waxy, olive green foliage. It produces small clusters of vase shaped flowers in fall, which develop into berry-like fruits"
    },
    {
        "common": "7-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Dymondia margaretae",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Silver Carpet is a ground hugging evergreen ground cover from South Africa. The short blades of felt textured, gray green foliage lay nearly flat, giving the illusion of a frosted lawn. Silver Carpet is a good filler between paving stones, a good ground cover and has even been used as a substitute for a lawn."
    },
    {
        "common": "8-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Artemisia schmidtiana",
        "zones": [
            "10",
            "12"
        ],
        "benefits": "Silver Mound Artemisia forms a low growing, 12-24\" mound of fragrant, fern-like, silvery gray foliage. The flowers that appear in mid summer are tiny and insignificant. Excellent accent plant for borders and rock gardens"
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Oxalis adenophylla",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Also known as Pink Carpet Oxalis, the Silver Shamrock is a very hardy, bulb type plant with beautifully pleated, silvery-blue foliage and pink flowers with violet-pink tips and cranberry centers from late spring into summer."
    },
    {
        "common": "4-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Antirrhinum Majas",
        "zones": [
            "9",
            "48"
        ],
        "benefits": "Snapdragons produce tall stalks of fragrant flowers that attract both butterflies and hummingbirds throughout the summer. Snapdragons are easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Soldanella alpina",
        "zones": [
            "6",
            null
        ],
        "benefits": "Clump forming, rounded leathery leaves; pale purple, fringed bells appear in early Spring"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Galanthus",
        "zones": [
            "4",
            "12"
        ],
        "benefits": "Snowdrops are small winter flowering bulbs with stems of nodding white, petal-less flowers"
    },
    {
        "common": "Hardy",
        "botanical": "\n",
        "height": [],
        "characteristics": "Cerastium tomentosum",
        "zones": [
            "4",
            null
        ],
        "benefits": "Invasive plant... loose clusters of white, one inch flowers; narrow, woolly oblong leaves"
    },
    {
        "common": "3-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Luzula nivea",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Snowy Woodrush forms loose clumps of dark green foliage and masses of white flowers in spring and early summer. It is useful as a ground cover."
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Saponaria ocymoides",
        "zones": [
            "4",
            null
        ],
        "benefits": "Forms thick mat of ground covering, fine foliage; hundreds of small pink to red flowers cover the plant in early Spring"
    },
    {
        "common": "4-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Polygonatum multiflorum",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "The Solomon's Seal is a shade loving, deciduous perennial that produces large, slow spreading clumps of arching, three feet stems lined with pairs of bright green leaves. In late spring, clusters of 2-5 elongated bell shaped, greenish-white flowers will hang beneath each pair of leaves."
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Chasmanthium latifolium",
        "zones": [
            "3",
            null
        ],
        "benefits": "Spangle Grass is a clump forming plant that produces gracefully nodding clusters of unique flat seed heads. Nice Fall color"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Cleome hasslerana",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "Spider Flowers are durable plants that make outstanding mass plantings which create the illusion of a large flowering shrub. They producebrightly colored, 8\" balls of blossoms from mid summer until early fall. Good for cut flowers. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tradescantia x andersoniana",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "Spiderworts are clump forming perennials that from early through mid-summer continuously produce butterfly attracting, 1\"-1½\", three petaled, triangular, flowers on stems that rise slightly above the narrow, strap-like foliage."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Veronica spicata",
        "zones": [
            "24",
            "36"
        ],
        "benefits": "Containers, Cut Flowers\nCompact, spreading, clump forming plant with deep green or silvery, felt-like foliage. Produces 12\" airy spikes of tiny flowers all summer. Remove spent flower spikes regularly to extend blooming season."
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Lamium species",
        "zones": [
            "4",
            "24"
        ],
        "benefits": "Spotted Deadnettle is a spreading, semi-evergreen member of the mint family. They are known for their beautiful silver and green variegation patterns in the textured foliage and spires of dainty, hooded flowers in early summer"
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Protasparagus 'Sprengeri'",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Sprenger's Asparagus has wirey green stems that are sparsely covered with clusters of 3-4, ¾\" cladodes along the stem. Declared a noxious weed in Florida, Hawaii and New Zealand."
    },
    {
        "common": "9-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Euphorbia amygdaloides",
        "zones": [
            "18",
            "30"
        ],
        "benefits": "Stiff, purplish-green leaves spiral outward around woody stems, upright clusters of golden-green flowers from mid spring until early summer"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Hypericum calycinum",
        "zones": [
            "18",
            "60"
        ],
        "benefits": "St. John's Wort is a vigorous grower that is useful for erosion control but it can be invasive. This drought tolerant plant thrives on neglect.\nHerbal and Medicinal uses of St. John's Wort plants"
    },
    {
        "common": "3-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Trachelospermum jasminoides",
        "zones": [],
        "benefits": "Star Jasmine aka: Confederate Jasmine is a twining, evergreen vine that produces clusters fragrant white star-shaped blooms in early summer. Can be grown as a creeping ground cover"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ornithogalum arabicum",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "The Star of Bethlehem is a bulb type plant that produces upright clusters of fragrant 1-2\" flowers in early summer. Can be grown in containers or as a House Plant"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Limonium sinuatum",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Statice has been cultivated since the mid 17th century as a garden flower, but also as an herb which was used for the treatment of dysentary as well as other ailments. Statice produces its flowers from early summer until frost, in the brightly colored bracts which grow atop the stiff, angular, 1-2 foot stems."
    },
    {
        "common": "\n10-12",
        "botanical": "\n",
        "height": [],
        "characteristics": "Aethionema armenum",
        "zones": [
            "6",
            null
        ],
        "benefits": "Low growing shrubby evergreen, with long lasting bright rose-pink flowers"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Sedum acre",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Creeping, small bright green leaves covered with small, star shaped, golden flowers in Spring"
    },
    {
        "common": "5-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Saxifraga stolonifera",
        "zones": [
            "3",
            "6"
        ],
        "benefits": "Strawberry Begonias are small, low growing, evergreen perennials that spread by runners called stolons. They have rounded, coarsely toothed, green leaves with silver marbling and covered with a fine hair, and having reddish undersides that form a loose rosette."
    },
    {
        "common": "6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Arbutus unedo",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Strawberry trees are upright evergreen shrubs with thick, leathery, dark green foliage. They produce hanging clusters of inverted urn-shaped flowers which develop into 1\", bright red spherical fruits that take a full year to ripen. The fruit is edible but not flavorful"
    },
    {
        "common": "7-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Bracteantha bracteata",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Paper Daisys are tender perennials usually grown as annuals. They need moist, but well drained soil. They can be propagated by softwood cuttings or grown from seed"
    },
    {
        "common": "\n10-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Eriogonum umbellatum",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "Low growing, spreading mat of 1\" green leaves; clusters of bright yellow flowers"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Helianthus annuus",
        "zones": [],
        "benefits": "Sunflowers are single stemmed annuals with large, fuzzy, silvery green, lance shape leaves. They produce long lasting, large single or multiple flower heads that range from 4-12\" depending on the variety."
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Plectranthus australis",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Swedish Ivy is a fast growing, spreading, evergreen perennial plant from South Africa that is closely related to the Coleus. They have slightly rounded, waxy, glossy green, 1½\"-2\" leaves with scalloped edges, and produce 3\"-8\" racemes of pink, lilac or white flowers."
    },
    {
        "common": "9-11",
        "botanical": "\n",
        "height": [],
        "characteristics": "Hierochloe odorata",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Sweetgrass has a very distinct scent and is easy to grow, but can become invasive so it should be grown in a container. The grass blades are sometimes braided and used as incense"
    },
    {
        "common": "2-6",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lathyrus odoratus",
        "zones": [],
        "benefits": "Sweet Peas have long been a favorite of gardeners because of the wonderful fragrance of the large clusters of colorful flowers that grace these annual vines all summer."
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Clethra alnifolia",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Sweet Pepperbush is an upright growing, deciduous shrub with light to dark green, deeply veined foliage. It produces spires of tiny, fragrant flowers from mid to late summer"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Dianthus barbatus",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Sweet William is a clump forming, deciduous biennial that prefers alkaline soil and dislikes heat. They produce a steady supply of fragrant, showy flowers from late spring to late summer, sometimes extending right up until the first frost."
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Galium odoratum",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Sweet Woodruff is a nice, mat forming ground cover for the shadier areas of your garden. Edible, fragrant green foliage and fragrant little white flowers in the springtime. Used for potpouri, a moth deterrent, roots used to make red dyes, flowers used to make yellow dyes"
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Panicum virgatum",
        "zones": [
            "5",
            null
        ],
        "benefits": "There are many cultivars of Switch Grass offering a variety of foliage colors and variations but their care is the same. Switch Grass is a larval host for some butterflies and provides seed for ground feeding birds."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Veronica longifolia",
        "zones": [
            "36",
            "18"
        ],
        "benefits": "Containers, Cut Flowers\nDeciduous, clump forming plant with soft, deep green foliage with serrated edges. Produces long lasting, dense, 6\" spikes of tiny flowers from late spring until mid summer. Cut plant back to 12\" after blooming for a repeat show in the fall."
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Polystichum polyblepharum",
        "zones": [
            "18",
            "24"
        ],
        "benefits": "Tassle Ferns are very showy and easy to grow. Their dark green fronds grow in a very symmetrical, rosette form. The stiff stems are covered with soft, copper-brown hairs. Tassle Ferns should be planted in compost rich, evenly moist soil in a area with partial to full shade."
    },
    {
        "common": "5-8",
        "botanical": "",
        "height": [],
        "characteristics": "Lupinus texensis",
        "zones": [
            "12",
            "24"
        ],
        "benefits": "The Texas Bluebonnet is an upright, mound forming perennial wildflower with large green, lance shaped leaves and spikes of blue, sweet pea-like flowers in late spring. Can be easily grown from seed"
    },
    {
        "common": "3-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Cirsium vulgare",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "There are many different species of Thistle, and nearly all of them are considered weeds. They are worst known for their prickly stems, prickly leaves and prickly flowers, but the butterflies like them"
    },
    {
        "common": "4-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Thymus",
        "zones": [
            "1",
            "12"
        ],
        "benefits": "Thyme is an evergreen perennial herb, native to the Mediterranean region. The dried leaves are used for cooking. Creeping Thyme forms low growing clumps that spread to about 1 ft. Bush Thyme forms a small, foot tall shrub. Flowers from late spring and through the summer. Thyme needs well draining soil."
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Coreopsis species",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "Coreopsis plants form nice, slow spreading clumps of green, fern-like or thread-like foliage with profusely blooming flowers that stand above the foliage on long, wirey stems. Coreopsis are excellent border or rock garden plants, and are great for cut flower arrangements."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tricyrtis hirta",
        "zones": [
            "30",
            "36"
        ],
        "benefits": "The Common Toad Lily is an easy to care for, slow spreading, clump forming perennial with 4\"-6\", deep green leaves alternating along multiple, 30\"-36\" upright, arching stems. Tricyrtis hirta produces loose clusters of awesome Toad flowers at each node along the stem."
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Kniphofia uvaria",
        "zones": [
            "1",
            "3"
        ],
        "benefits": "The multi-colored flower spikes of the Torch Lily will reach 2-5 feet in height, depending on the variety. The coloring may range from ivory and orange to coral red. Provide a winter mulch"
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Osteospermum fruticosum",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "The Trailing African Daisy is a tender perennial, grown as an annual in most areas. It will rapidly spread to cover a 2-3 ft. area with its light green, two inch foliage. It will produce masses of pretty, daisy-like flowers sporadically throughout the year. Deadhead for more blooms"
    },
    {
        "common": "\n9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Calibrachoa",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "Calibracoa shares most of the features of a Petunia, except everything is shrunk down to about one fourth the size. Trailing Petunias are easy to care for, fast growing plants that will produce an abundance of Petunia-like blooms all summer long."
    },
    {
        "common": "\n9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Gerbera jamesonii",
        "zones": [
            "10",
            "15"
        ],
        "benefits": "Gerbera plants have dark green, deeply cut, 10\" leaves with fuzzy undersides. Large, brightly colored, Daisy-like flowers stand above the foliage on stiff, leafless stems all summer."
    },
    {
        "common": "8-11",
        "botanical": " \n",
        "height": [],
        "characteristics": "Ledum glandulosum",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Trapper's Tea is an extremely hardy relative of the Rhododendron, usually found in boggy areas or at the edge of small streams. Aromatic white flowers in late Spring"
    },
    {
        "common": "2-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Gazania",
        "zones": [
            "6",
            "8"
        ],
        "benefits": "The Treasure Flower's brightly bi-colored, daisy-like flowers are 2-5 inches in diameter, growing atop 6-12 inch stalks. The foliage is somewhat grass like, but narrow at the base and widening toward the tip."
    },
    {
        "common": "",
        "botanical": "\n",
        "height": [],
        "characteristics": "Sedum spurium 'tricolor'",
        "zones": [
            "4",
            "6"
        ],
        "benefits": "Stonecrop are creeping, succulent ground cover plants. It forms a loose carpet of small green, pink and white tri colored leaves. It produces clusters of tiny star flowers in the summer. Excellent for rock gardens or can be grown in a a planter."
    },
    {
        "common": "2-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Trillium grandiflorum",
        "zones": [
            "8",
            "24"
        ],
        "benefits": "Trilliums are shade loving, spring blooming perennial woodland wildflowers. They have three dark green, single layer leaves below a green three leaf whorl, below their large three petal flower. Trilliums will most likely perish if their foliage is cut from the plant"
    },
    {
        "common": "3-7",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Tritonia",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Tritonias are corm growing plants from South Africa that produce pretty little six petaled flowers in late spring. They dislike wet environments."
    },
    {
        "common": "Hardy",
        "botanical": "\n",
        "height": [],
        "characteristics": "Campsis radicans",
        "zones": [
            "30",
            null
        ],
        "benefits": "Trumpet Creeper is a deciduous, clinging vine which grows to great heights. It produces large orange-red trumpet shaped blooms throughout the summer. A hummingbird favorite"
    },
    {
        "common": "4-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Gentiana acaulis",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Mat of glossy 1 inch green leaves; disproportionate 3 inch, blue trumpet flowers in early Summer"
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lonicera sempervirens",
        "zones": [],
        "benefits": "Coral Honeysuckle is a fast growing, high climbing, semi-evergreen vine. It produces clusters of intensely colored, trumpet shaped flowers all summer then red berries in the fall"
    },
    {
        "common": "4-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Campsis tagliabuana",
        "zones": [],
        "benefits": "This Trumpet Vine is a vigorous growing, low maintenance climber with the ability to cling to walls with its root like tendrils. It produces brightly colored 2-3\" trumpet shaped flowers from mid summer into early fall"
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Begonia tuberhybrida",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Reiger Begonias are a hybrid cross between Tuberous Begonias and Wax Begonias. With proper care, they will remain in bloom for several months. They can be planted in pots and grown as a house plant"
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Deschampsia cespitosa",
        "zones": [
            "2",
            "3"
        ],
        "benefits": "Tufted Hair Grass is a semi evergreen plant that has a wide range of cultivars in colors from creamy white to green and bronze"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Veronica liwanensis",
        "zones": [
            "3",
            "24"
        ],
        "benefits": "Groundcover, Rock Gardens, Lawn Substitute\nTough, drought tolerant evergreen, mat forming plant with tiny, glossy, evergreen leaves that turn reddish bronze in hot sun. Covers itself with clusters of bright blue flowers all summer. Tolerates occasional walking. Requires good drainage"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Diascia barberae",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Twinspurs are a vigorous growing, tender perennials that are closely related to the Snapdragon. They have small, heart shaped foliage and grow from 6\"-12\" tall, forming 8\"-20\" clumps. From late spring until early fall, they produce bright pink or salmon colored, 1/2\"-3/4\" flowers."
    },
    {
        "common": "\n8-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Cyperus Alternifolius",
        "zones": [
            "3",
            "4"
        ],
        "benefits": "Umbrella Grass is a native of the swamps of Madagascar. It is a close relative of the Papyrus Plant. Thrives in wet areas"
    },
    {
        "common": "9-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Verbena species",
        "zones": [
            "6",
            "5"
        ],
        "benefits": "There are about 250 annual and perennial species of Verbena but there are only about a half dozen that are commonly cultivated. These easy to grow, long blooming plants are both heat and drought tolerant. Trailing forms of Verbena are excellent for growing in containers and hanging baskets."
    },
    {
        "common": "vary",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Viburnum bodnantense",
        "zones": [
            "8",
            "10"
        ],
        "benefits": "Viburnum are deciduous shrubs that produce clusters of very fragrant pink flowers in mid-winter to early spring. Deeply textured foliage. Can be propagated by softwood cuttings"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Acer circinatum",
        "zones": [
            "15",
            "20"
        ],
        "benefits": "Vine Maple grow well in a wide variety of soil types, varying levels of sunlight and tolerate almost any level of watering once established"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Viola sp",
        "zones": [
            "2",
            "6"
        ],
        "benefits": "Violets are dainty little self seeding versions of the Pansy. Their seeds can be directly sown into the garden at anytime from spring through fall, but the seeds need darkness and 70° to germinate"
    },
    {
        "common": "\n4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Iochroma cyaneum",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Violet Tubeflowers are shrubby, evergreen plants. They are sometimes called Mini Brugs, because they resemble and are a close relative of Brugmansias. they produce umbel-like, dangling clusters of up to 20, 2\"-3\", tubular, deep purple flowers."
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Parthenocissus quinquefolia",
        "zones": [],
        "benefits": "Virginia Creeper is a fast growing deciduous vine with intensely rich red fall color. It easily clings to walls or a trellis, or can be allowed to creep as a ground cover. The berries are highly toxic!"
    },
    {
        "common": " ",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Clematis paniculata",
        "zones": [],
        "benefits": "Very hardy semi-evergreen climber, will quickly grow to 30 feet, small clusters of fragrant white blooms in late summer and again in the fall. Clematis like their heads in the sun and their roots in the shade"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Erysimum",
        "zones": [
            "1",
            "4"
        ],
        "benefits": "The Wallflower is an old-fashioned perennial garden flower which is usually grown as an annual or biennial because it tends to 'bloom itself to death'. The profusion of fragrant, bright orange flowers in early spring makes this plant an excellent choice for the butterfly garden, flower bed, or garden border."
    },
    {
        "common": "\n6-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Nymphaea species",
        "zones": [
            "18",
            "36"
        ],
        "benefits": "There are about fifty species of Water Lily plants. Water Lilies are tuberous growing plants that can be planted in pots and submerged in your pond or even in a tub on your patio, where they will send up round, floating leaves and beautiful, sometimes fragrant, star shaped flowers to the surface."
    },
    {
        "common": "Varies",
        "botanical": "\n",
        "height": [],
        "characteristics": "Begonia semperflorens",
        "zones": [
            "6",
            "12"
        ],
        "benefits": "Dwarf varieties of Wax Begonia grow from 6\"-8\" tall. Tall varieties grow from 10\"-12\" tall. They have succulent stems and waxy, deep green to dark mahogany colored foliage, and they produce loose clusters of single or double, white, pink or red flowers from early May until October."
    },
    {
        "common": "9-11",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Weigela rosea",
        "zones": [
            "6",
            null
        ],
        "benefits": "Weeping Weigela are easy to care for deciduous shrubs They cover themselves with brightly colored, five petal star flowers from May to June. Can be grown into a beautiful hedge"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Cornus nuttallii",
        "zones": [
            "25",
            "40"
        ],
        "benefits": "The Western Flowering Dogwood is a deciduous tree with soft, light green foliage. In spring they produce sets of bright white or pink bracts which hold tiny purple-tipped green flowers. Red berries develop in the fall"
    },
    {
        "common": "7-8",
        "botanical": "\n",
        "height": [],
        "characteristics": "Polystichum munitum",
        "zones": [
            "3",
            "5"
        ],
        "benefits": "Native to the coastal forests of North America, this large, easy to grow fern grows best when planted in compost rich soil in a cool, shady, moist garden location. Western Sword Ferns are deer resistant and suitable for growing in the acidic soil found beneath Cedar Trees and other conifers."
    },
    {
        "common": "5-9",
        "botanical": " \n",
        "height": [],
        "characteristics": "Draba aizoides",
        "zones": [
            "4",
            null
        ],
        "benefits": "Small rosette of tiny gray or green leaves; bright yellow flowers in late Spring"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Asarum species",
        "zones": [
            "6",
            "10"
        ],
        "benefits": "Wild Gingers are low growing, woodland perennials that are known for their showy, Cyclamen-like, heart shaped foliage and their very unique, three lobed flowers that hide from view below the foliage."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Ceanothus cuneatus",
        "zones": [
            "4",
            "8"
        ],
        "benefits": "The Wild Lilac or Buckbrush is a drought tolerant shrub, native to the west coast. The sprays of white to light blue flowers are very fragrant in late Spring"
    },
    {
        "common": "6-10",
        "botanical": "\n \n",
        "height": [],
        "characteristics": "Fragaria chiloensis",
        "zones": [
            "6",
            null
        ],
        "benefits": "Wild Strawberries look about the same as the Strawberries that are cultivated for their fruit and their care is the same, but this variety is grown primarily as a ground cover due to its thick growing, glossy foliage. The fruit is edible but not very flavorful"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Anemone pulsatilla",
        "zones": [
            "8",
            "12"
        ],
        "benefits": "Fernlike foliage follows the pretty blue flowers in May"
    },
    {
        "common": "4-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Euonymus fortunei",
        "zones": [],
        "benefits": "Wintercreeper is an adaptable, deciduous climbing vine. The flowers are fairly inconspicuous, but they result in bright orange seeds that attract and feed a wide variety of birds"
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Barbarea orthoceras",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Winter Cress is one of the earliest blooming wildflowers. It is a moisture loving member of the mustard family that produces clusters of <½ flowers from early spring until early fall."
    },
    {
        "common": "4-7",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Daphne odora",
        "zones": [
            "4",
            null
        ],
        "benefits": "Winter Daphne is a popular spreading, evergreen shrub that blooms in February and March, producing a cluster of fragrant, pink to red flowers at the end of each branch. The narrow, dark green, 3\" leaves are thick and glossy. Winter Daphne plants will grow to a height of four feet, with a 6-8 foot spread."
    },
    {
        "common": "8-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Muehlenbeckia complexa",
        "zones": [],
        "benefits": "The Wire Vine is a twining evergreen vine that is able to climb a support or can be left to ramble across the ground. It has small, round, dark green leaves and produces tiny cream colored flowers in the spring"
    },
    {
        "common": "6-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Wisteria frutescens",
        "zones": [],
        "benefits": "Wisteria is a hardy deciduous vine that produces massive clusters of fragrant lavender or white blooms in late spring. Wisteria can be pruned to form large shrub or small tree"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Hamamelis mollis",
        "zones": [
            "10",
            "15"
        ],
        "benefits": "Witch Hazel is a low maintenance deciduous shrub which is one of the earliest blooming shrubs, providing you with lots of showy, fragrant flowers beginning in early February"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Lonicera periclymenum",
        "zones": [],
        "benefits": "Honeysuckle vines are easy to grow, vigorous, heat-tolerant, and nearly indestructible. The flashy and fragrant flowers will attract hummingbirds and butterflies all summer long."
    },
    {
        "common": "5-9",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Luzula sylvatica",
        "zones": [
            "1",
            "2"
        ],
        "benefits": "Woodrush is an easy to grow and durable, slow growing grass-like plant that will even survive in dry shade. Variegated varieties are available"
    },
    {
        "common": "4-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Oxalis oregana",
        "zones": [
            "6",
            null
        ],
        "benefits": "Studies show that 9 out of 10 Gnomes prefer Wood Sorrel as their garden carpeting over any other ground cover. Wood Sorrel is a deciduous clover-like ground cover plant that produces small, star shaped flowers throughout the spring and summer"
    },
    {
        "common": "7-10",
        "botanical": "\n",
        "height": [],
        "characteristics": "Thymus pseudolanuginosus",
        "zones": [
            "1",
            null
        ],
        "benefits": "Spreading mat of tiny, hairy, light green foliage; covered by tiny pink flowers in mid Summer. Several aromatic Thymes are also available."
    },
    {
        "common": "3-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Achillea tomentosa",
        "zones": [
            "9",
            "12"
        ],
        "benefits": "Woolly Yarrow is a very durable and low maintenance perennial with aromatic, grayish green, strap-like leaves. It produces small clusters that continue throughout the summer. Very drought tolerant"
    },
    {
        "common": "5-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Achillea millefolium",
        "zones": [
            "2",
            "4"
        ],
        "benefits": "Yarrow belongs to a group of plants that includes annual and perennial, drought resistant plants that will grow in almost any garden soil. It is a long blooming perennial wildflower with fern like grayish green foliage and 4-6\" flower clusters"
    },
    {
        "common": "3-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Corydalis lutea",
        "zones": [
            "12",
            "15"
        ],
        "benefits": "Corydalis lutea is a short lived perennial wildflower that is very easy to grow and care for. They grow 12\"-15\" tall and gradually form 24\" diameter mounds of light grayish, fern like foliage. Sprays of bright yellow, 1\" tubular flowers begin to appear in early May and will continue until the first frosts of Fall."
    },
    {
        "common": "6-10",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Carex flava",
        "zones": [
            "18",
            "30"
        ],
        "benefits": "Although it is not commonly grown as ornamental, Yellow Sedge is durable and adaptable. It has yellow striped foliage, and produces seed for the birds winter feeding."
    },
    {
        "common": "4-8",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Miscanthus sinensis 'Strictus'",
        "zones": [
            "5",
            "7"
        ],
        "benefits": "Zebra Grass grows as an upright clump of coarse, gold speckled leaves. Fairly drought tolerant and grows in a wide range of soil types but does best in rich, moist soil"
    },
    {
        "common": "5-9",
        "botanical": "\n",
        "height": [],
        "characteristics": "Aphelandra squarrosa",
        "zones": [
            "12",
            "18"
        ],
        "benefits": "Zebra Plants are extremely showy evergreen plants with pairs of shiny, 6\"-9\", lance shaped green leaves, boldly variegated with cream, white or silvery striped veins. Under ideal conditions, they can be persuaded to bloom."
    },
    {
        "common": "11-12",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "Zinnia elegans",
        "zones": [
            "6",
            "40"
        ],
        "benefits": "Zinnias are easy to grow annual plants that produce an abundance of brightly colored 2-3\" flowers through the summer months. They grow well in containers and make excellent cut flower arrangements. They dislike wet foliage. Can be easily grown from seed"
    },
    {
        "common": "",
        "botanical": "\n\n",
        "height": [],
        "characteristics": "",
        "zones": [
            "11",
            null
        ],
        "benefits": ""
    },
    {
        "common": "spot treating dandelions.. lost cause?  (12 replies)",
        "botanical": "",
        "height": [
            "26",
            null
        ],
        "characteristics": "",
        "zones": [
            "392",
            null
        ],
        "benefits": ""
    },
    {
        "common": "How often do you REALLY water your lawn?  (29 replies)",
        "botanical": "",
        "height": [
            "2",
            null
        ],
        "characteristics": "\t",
        "zones": [],
        "benefits": ""
    }
]